import * as React from 'react';
import {
  Text,
  StyleSheet,
  View,
  Button,
  TouchableOpacity,
  Image,
  ScrollView,
  ImageBackground,
  StatusBar,
  TextInput,
  Dimensions,
  Modal,
  AsyncStorage,
  BackHandler
} from 'react-native';
import FontAwesome5 from 'react-native-vector-icons/FontAwesome5';
import AntDesign from 'react-native-vector-icons/AntDesign';
import * as Animatable from 'react-native-animatable';
const { width, height } = Dimensions.get('window');
import { COLORS } from '../constants';
// import { StackNavigator} from 'react-navigation';

// import {useNavigation} from '@react-navigation/native';

export default class Azkar extends React.Component {
   
  // backAction = () => {
  
  //   this.props.navigation.navigate('HomeStack', { screen: 'Sabah' })
  //   return true;
  // };

  // componentWillUnmount() {
  //   this.backHandler.remove();
  // }


  // componentDidMount() {
  //    this.backHandler = BackHandler.addEventListener(
  //     "hardwareBackPress",
  //     this.backAction
  //   );

  // }




  constructor(props) {
    super(props); {
      this.state = {

        Arr1: [
          {
            levels: "الأذكار بعد الصلاة",
            Open: false,
            poem: [
              { Name: "أَسْتَغْفِرُ اللَّهَ . (ثَلاثاً) اللَّهُمَّ أَنْتَ السَّلاَمُ، وَمِنْكَ السَّلَامُ، تَبَارَكْتَ يَا ذَا الْجَلَالِ وَالإِكْرَامِ ." }, { Name: "لَا إلَهَ إِلاَّ اللَّهُ وَحْدَهُ لَا شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ، اللَّهُمَّ لَا مَانِعَ لِمَا أَعْطَيْتَ، وَلَا مُعْطِيَ لِمَا مَنَعْتَ، وَلَا يَنْفَعُ ذَا الْجَدِّ مِنْكَ الْجَدُّ." },
              { Name: "سُبْحَانَ اللَّهِ، وَالْحَمْدُ لِلَّهِ، وَاللَّهُ أَكْبَرُ. (ثلاثاً وثلاثين) لَا إِلَهَ إِلاَّ اللَّهُ وَحْدَهُ لَا شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ ." }, { Name: "قُلْ هُوَ اللهُ أَحَدٌ. اللهُ الصَّمَدُ. لَمْ يَلِدْ وَلَمْ يُولَدْ. وَلَمْ يَكُنْ لَهُ كُفُوًا أَحَدٌ. [ الإِخْـلاصْ ] قُلْ أَعُوذُ بِرَبِّ الْفَلَقِ. مِنْ شَرِّ مَا خَلَقَ. وَمِنْ شَرِّ غَاسِقٍ إِذَا وَقَبَ. وَمِنْ شَرِّ النَّفَّاثَاتِ فِي الْعُقَدِ. وَمِنْ شَرِّ حَاسِدٍ إِذَا حَسَدَ [ الفَلَـقْ ] قُلْ أَعُوذُ بِرَبِّ النَّاسِ. مَلِكِ النَّاسِ. إِلَهِ النَّاسِ. مِنْ شَرِّ الْوَسْوَاسِ الْخَنَّاسِ. الَّذِي يُوَسْوِسُ فِي صُدُورِ النَّاسِ. مِنَ الْجِنَّةِ وَالنَّاسِ [ الـنّاس ] (ثلاث مرات بعد صلاتي الفجر والمغرب. ومرة بعد الصلوات الأخرى)" },
              { Name: "اللَّهُ لاَ إِلَهَ إِلاَّ هُوَ الْحَيُّ الْقَيُّومُ لاَ تَأْخُذُهُ سِنَةٌ وَلاَ نَوْمٌ لَّهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الأَرْضِ مَن ذَا الَّذِي يَشْفَعُ عِنْدَهُ إِلاَّ بِإِذْنِهِ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ وَلاَ يُحِيطُونَ بِشَىْءٍ مِّنْ عِلْمِهِ إِلاَّ بِمَا شَاءَ وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ وَالأَرْضَ وَلاَ يَؤُودُهُ حِفْظُهُمَا وَهُوَ الْعَلِيُّ الْعَظِيمُ" }, { Name: "لَا إِلَهَ إِلَّا اللَّهُ وَحَدْهُ لَا شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ يُحْيِي وَيُمِيتُ وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ . (عَشْر مَرّات بَعْدَ المَغْرِب وَالصّـبْح )" },
              { Name: "اللَّهُمَّ إِنِّي أَسْأَلُكَ عِلْماً نَافِعاً وَرِزْقاً طَيِّباً، وَعَمَلاً مُتَقَبَّلاً . (بَعْد السّلامِ من صَلاةِ الفَجْر )" }
            ]
          },
          {
            levels: "أذكار الصباح",
            Open: false,
            poem: [
              { Name: "أَصْبَحْنَا وَأَصْبَحَ الْمُلْكُ لِلَّهِ وَالْحَمْدُ لِلَّهِ، لَا إِلَهَ إِلَّّا اللَّهُ وَحْدَهُ لَا شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ، رَبِّ أَسْأَلُكَ خَيْرَ مَا فِيْ هَذَا الْيَوْمِ وَخَيْرَ مَا بَعْدَهُ، وَأَعُوْذُ بِكَ مِنْ شَرِّ مَا فِي هَذَا الْيَوْمِ وَشَرِّ مَا بَعْدَهُ، رَبِّ أَعُوْذُ بِكَ مِنَ الْكَسَلِ، وَسُوءِ الْكِبَرِ، رَبِّ أَعُوْذُ بِكَ مِنْ عَذَابٍ فِيْ النَّارِ وَعَذَابٍ فِيْ الْقَبْرِ" }, { Name: 'اللَّهُمَّ بِكَ أَصْبَحْنَا، وَبِكَ أَمْسَيْنَا، وَبِكَ نَحْيَا، وَبِكَ نَمُوتُ، وَإِلَيْكَ النُّشُورُ' },
              { Name: "اللَّهُمَّ أَنْتَ رَبِّي لَّا إِلَهَ إِلَّا أَنْتَ، خَلَقْتَنِي وَأَنَا عَبْدُكَ، وَأَنَا عَلَى عَهْدِكَ وَوَعْدِكَ مَا اسْتَطَعْتُ، أَعُوذُ بِكَ مِنْ شَرِّ مَا صَنَعْتُ، أَبُوءُ لَكَ بِنِعْمَتِكَ عَلَيَّ، وَأَبُوءُ بِذَنْبِي فَاغْفِر لِي فَإِنَّهُ لَا يَغْفِرُ الذُّنُوبَ إِلَّا أَنْتَ" }, { Name: "اللَّهُمَّ إِنِّي أَصْبَحْتُ أُشْهِدُكَ وَأُشْهِدُ حَمَلَةَ عَرْشِكَ، وَمَلَائِكَتَكَ وَجَمِيعَ خَلْقِكَ، أَنَّكَ أَنْتَ اللَّهُ لَا إِلَهَ إِلَّا أَنْتَ وَحْدَكَ لَا شَرِيكَ لَكَ، وَأَنَّ مُحَمَّداً عَبْدُكَ وَرَسُولُكَ (أربع مرات)" },
              { Name: "اللَّهُمَّ عَافِـني فِي بَدَنِي، اللَّهُمَّ عَافِـنِي فِي سَمْعِي، اللَّهُمَّ عَافِنِي فِي بَصَرِي، لَا إِلَهَ إلاَّ أَنْتَ.(ثلاثاً) اللَّهُمَّ إِنِّي أَعُوذُبِكَ مِنَ الْكُفْر، وَالفَقْرِ، وَأَعُوذُبِكَ مِنْ عَذَابِ الْقَبْرِ ، لَا إلَهَ إلاَّ أَنْتَ. (ثلاثاً)" }, { Name: "اللَّهُمَّ مَا أَصْبَحَ بِي مِنْ نِعْمَةٍ أَوْ بِأَحَدٍ مِنْ خَلْقِكَ فَمِنْكَ وَحْدَكَ لَا شَرِيكَ لَكَ، فَلَكَ الْحَمْدُ وَلَكَ الشُّكْرُ" },
              { Name: "أَعُوذُ بِكَلِمَاتِ اللَّهِ التَّامَّاتِ مِنْ شَرِّ مَا خَلَقَ. (ثلاثاً إِذا أمسى)" }, { Name: "حَسْبِيَ اللَّهُ لَآ إِلَهَ إِلَّا هُوَ عَلَيْهِ تَوَكَّلْتُ وَهُوَ رَبُّ الْعَرْشِ الْعَظِيمِ. (سبع مَرّات حينَ يصْبِح وَيمسي)" },
              { Name: "اللَّهُمَّ عَالِمَ الْغَيْبِ وَالشَّهَادَةِ فَاطِرَ السَّماوَاتِ وَالْأَرْضِ، رَبَّ كُلِّ شَيْءٍ وَمَلِيكَهُ، أَشْهَدُ أَنْ لَا إِلَهَ إِلَّا أَنْتَ، أَعُوذُ بِكَ مِنْ شَرِّ نَفْسِي، وَمِنْ شَرِّ الشَّيْطَانِ وَشِرْكِهِ، وَأَنْ أَقْتَرِفَ عَلَى نَفْسِي سُوءاً أَوْ أَجُرَّهُ إِلَى مُسْلِمٍ" }, { Name: "اللَّهُمَّ إِنِّي أَسْأَلُكَ الْعَفْوَ وَالْعَافِيَةَ فِي الدُّنْيَا وَالْآخِرَةِ، اللَّهُمَّ إِنِّي أَسْأَلُكَ الْعَفْوَ وَالْعَافِيَةَ فِي دِينِي، وَدُنْيَايَ، وَأَهْلِي، وَمَالِي، اللَّهُمَّ اسْتُرْ عَوْرَاتِي، وَآمِنْ رَوْعَاتِي، اللَّهُمَّ احْفَظْنِي مِنْ بَيْنِ يَدَيَّ، وَمِنْ خَلْفِي، وَعَنْ يَمِينِي، وَعَنْ شِمَالِي، وَمِنْ فَوْقِي، وَأَعُوذُ بِعَظَمَتِكَ أَنْ أُغْتَالَ مِنْ تَحْتِيَ" },
              { Name: "رَضِيتُ باللَّهِ رَبًّا، وَبِالْإِسْلَامِ دِيناً، وَبِمُحَمَّدٍ صَلَى اللَّهُ عَلِيهِ وَسَلَّمَ نَبِيَّاً. (ثلاثاً)" }, { Name: "بِسْمِ اللَّهِ الَّذِي لَا يَضُرُّ مَعَ اسْمِهِ شَيْءٌ فِي الَْأرْضِ وَلَا فِي السَّمَاءِ وَهُوَ السَّمِيعُ الْعَلِيمُ. (ثلاثاً)" },
              { Name: "سُبْحَانَ اللَّهِ وَبِحَمْدِهِ . (مائة مرة)" }, { Name: "سُبْحَانَ اللَّهِ وَبِحَمْدِهِ عَدَدَ خَلْقِهِ، وَرِضَا نَفْسِهِ، وَزِنَةَ عَرْشِهِ وَمِدَادَ كَلِمَاتِهِ . (ثلاثاً)" },
              { Name: "لَا إِلَهَ إِلَّا اللَّهُ وَحْدَهُ لَا شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ، وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ . (مائة مرة)" }, { Name: "يَاحَيُّ، يَا قَيُّومُ، بِرَحْمَتِكَ أَسْتَغِيثُ، أَصْلِحْ لِي شَأْنِي كُلَّهُ، وَلَا تَكِلْنِي إِلَى نَفْسِي طَرْفَةَ عَيْنٍ" },
              { Name: "أَصْبَحْنَا وَأَصْبَحَ الْمُلْكُ لِلَّهِ رَبِّ الْعَالَمِينَ، اللَّهُمَّ إِنِّـي أَسْأَلُكَ خَـيْرَ هَذَا الْـيَوْمِ ، فَتْحَهُ، وَنَصْرَهُ، وَنُورَهُ وَبَرَكَتَهُ، وَهُدَاهُ، وَأَعُوذُ بِكَ مِنْ شَرِّ مَا فِيهِ وَشَرِّ مَا بَعْدَهُ" }

            ]
          },
          {
            levels: "أذكار المساء",
            Open: false,
            poem: [
              { Name: "اَمْسَيْنَا وَاَمْسَ الْمُلْكُ لِلَّهِ وَالْحَمْدُ لِلَّهِ، لَا إِلَهَ إِلَّّا اللَّهُ وَحْدَهُ لَا شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ، رَبِّ أَسْأَلُكَ خَيْرَ مَا فِيْ هَذَا اللَّيْلَةِ وَخَيْرَ مَا بَعْدَهُ، وَأَعُوْذُ بِكَ مِنْ شَرِّ مَا فِي هَذَا اللَّيْلَةِ وَشَرِّ مَا بَعْدَهُ، رَبِّ أَعُوْذُ بِكَ مِنَ الْكَسَلِ، وَسُوءِ الْكِبَرِ، رَبِّ أَعُوْذُ بِكَ مِنْ عَذَابٍ فِيْ النَّارِ وَعَذَابٍ فِيْ الْقَبْرِ" }, { Name: "اللَّهُمَّ بِكَ أَمْسَيْنَا، وَبِكَ أَصْبَحْنَا، وَبِكَ نَحْيَا، وَبِكَ نَمُوتُ وَإِلَـيْكَ المَصِيْر" },
              { Name: "اللَّهُمَّ أَنْتَ رَبِّي لَّا إِلَهَ إِلَّا أَنْتَ، خَلَقْتَنِي وَأَنَا عَبْدُكَ، وَأَنَا عَلَى عَهْدِكَ وَوَعْدِكَ مَا اسْتَطَعْتُ، أَعُوذُ بِكَ مِنْ شَرِّ مَا صَنَعْتُ، أَبُوءُ لَكَ بِنِعْمَتِكَ عَلَيَّ، وَأَبُوءُ بِذَنْبِي فَاغْفِر لِي فَإِنَّهُ لَا يَغْفِرُ الذُّنُوبَ إِلَّا أَنْتَ" }, { Name: "اللَّهُمَّ أَمْسَيْنَا نُشْهِدُكَ وَنُشْهِدُ حَمَلَةَ عَرْشِكَ وَمَلاَئِكَتَكَ وَجَمِيعَ خَلْقِكَ بِأَنَّكَ الله لاَ إِلَهَ إِلاَّ أَنْتَ وَحْدَكَ لاَ شَرِيكَ لَكَ وَأَنَّ مُحَمَّدًا عَبْدُكَ وَرَسُولُكَ" },
              { Name: "اللَّهُمَّ مَا أََمْسَ بِي مِنْ نِعْمَةٍ أَوْ بِأَحَدٍ مِنْ خَلْقِكَ فَمِنْكَ وَحْدَكَ لَا شَرِيكَ لَكَ، فَلَكَ الْحَمْدُ وَلَكَ الشُّكْرُ" }, { Name: "اللَّهُمَّ عَافِـني فِي بَدَنِي، اللَّهُمَّ عَافِـنِي فِي سَمْعِي، اللَّهُمَّ عَافِنِي فِي بَصَرِي، لَا إِلَهَ إلاَّ أَنْتَ.(ثلاثاً) اللَّهُمَّ إِنِّي أَعُوذُبِكَ مِنَ الْكُفْر، وَالفَقْرِ، وَأَعُوذُبِكَ مِنْ عَذَابِ الْقَبْرِ ، لَا إلَهَ إلاَّ أَنْتَ. (ثلاثاً)" },
              { Name: "حَسْبِيَ اللَّهُ لَآ إِلَهَ إِلَّا هُوَ عَلَيْهِ تَوَكَّلْتُ وَهُوَ رَبُّ الْعَرْشِ الْعَظِيمِ. (سبع مَرّات حينَ يصْبِح وَيمسي)" }, { Name: "أَعُوذُ بِكَلِمَاتِ اللَّهِ التَّامَّاتِ مِنْ شَرِّ مَا خَلَقَ. (ثلاثاً إِذا أمسى)" },
              { Name: "اللَّهُمَّ إِنِّي أَسْأَلُكَ الْعَفْوَ وَالْعَافِيَةَ فِي الدُّنْيَا وَالْآخِرَةِ، اللَّهُمَّ إِنِّي أَسْأَلُكَ الْعَفْوَ وَالْعَافِيَةَ فِي دِينِي، وَدُنْيَايَ، وَأَهْلِي، وَمَالِي، اللَّهُمَّ اسْتُرْ عَوْرَاتِي، وَآمِنْ رَوْعَاتِي، اللَّهُمَّ احْفَظْنِي مِنْ بَيْنِ يَدَيَّ، وَمِنْ خَلْفِي، وَعَنْ يَمِينِي، وَعَنْ شِمَالِي، وَمِنْ فَوْقِي، وَأَعُوذُ بِعَظَمَتِكَ أَنْ أُغْتَالَ مِنْ تَحْتِيَ" }, { Name: "اللَّهُمَّ عَالِمَ الْغَيْبِ وَالشَّهَادَةِ فَاطِرَ السَّماوَاتِ وَالْأَرْضِ، رَبَّ كُلِّ شَيْءٍ وَمَلِيكَهُ، أَشْهَدُ أَنْ لَا إِلَهَ إِلَّا أَنْتَ، أَعُوذُ بِكَ مِنْ شَرِّ نَفْسِي، وَمِنْ شَرِّ الشَّيْطَانِ وَشِرْكِهِ، وَأَنْ أَقْتَرِفَ عَلَى نَفْسِي سُوءاً أَوْ أَجُرَّهُ إِلَى مُسْلِمٍ" },
              { Name: "بِسْمِ اللَّهِ الَّذِي لَا يَضُرُّ مَعَ اسْمِهِ شَيْءٌ فِي الَْأرْضِ وَلَا فِي السَّمَاءِ وَهُوَ السَّمِيعُ الْعَلِيمُ. (ثلاثاً)" }, { Name: "رَضِيتُ باللَّهِ رَبًّا، وَبِالْإِسْلَامِ دِيناً، وَبِمُحَمَّدٍ صَلَى اللَّهُ عَلِيهِ وَسَلَّمَ نَبِيَّاً. (ثلاثاً)" },
              { Name: "سُبْحَانَ اللَّهِ وَبِحَمْدِهِ عَدَدَ خَلْقِهِ، وَرِضَا نَفْسِهِ، وَزِنَةَ عَرْشِهِ وَمِدَادَ كَلِمَاتِهِ . (ثلاثاً)" }, { Name: "سُبْحَانَ اللَّهِ وَبِحَمْدِهِ . (مائة مرة)" },
              { Name: "يَاحَيُّ، يَا قَيُّومُ، بِرَحْمَتِكَ أَسْتَغِيثُ، أَصْلِحْ لِي شَأْنِي كُلَّهُ، وَلَا تَكِلْنِي إِلَى نَفْسِي طَرْفَةَ عَيْنٍ" }, { Name: "لَا إِلَهَ إِلَّا اللَّهُ وَحْدَهُ لَا شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ، وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ . (مائة مرة)" },
              { Name: "أَمْسَيْنَا وَأَمْسَى الْمُلْكُ لِلَّهِ رَبِّ الْعَالَمِينَ اللَّهُمَّ إِنِّي أَسْأَلُكَ خَيْرَ هَذِهِ اللَّيْلَةَ فَتْحَهَا وَنَصْرَهَا وَنُورَهَا وَبَرَكَتَهَا وَهُدَاهَا وَأَعُوذُ بِكَ مِنْ شَرِّ مَا فِيهَا وَشَرِّ مَا بَعْدَهَا" }

            ]
          },
        ],
        model_visibe2: false,
        Arr2: [

          { Name: 'قال رسول الله صلى الله عليه وآله وصحبه وسلم: (أبْغَضُ الرجال إلى الله الألَدُّ الخَصِم). رواه البخاري ومسلم.' }, { Name: 'قال رسول الله صلى الله عليه وآله وصحبه وسلم: (اتق الله حيثما كنت، وأتبع السيئة الحسنة تمحها، وخالق الناس بخلق حسن). حديث حسن رواه الترمذي.' },
          { Name: 'قال رسول الله صلى الله عليه وآله وصحبه وسلم: (أحب البلاد إلى الله مساجدها، وأبغض البلاد إلى الله أسواقها). رواه مسلم.' }, { Name: 'قال رسول الله صلى الله عليه وآله وصحبه وسلم: (أحبوا الله لما يغذوكم به من نعمه، وأحبوني لحب الله، وأحبوا أهل بيتي لحبي). رواه الترمذي.' },
          { Name: 'قال رسول الله صلى الله عليه وآله وصحبه وسلم: (بشر المشّائينَ في الظُّلَم إلى المساجد بالنور التام يوم القيامة). حديث صحيح رواه أبو داود.' }, { Name: 'قال رسول الله صلى الله عليه وآله وصحبه وسلم: (بروا آباءكم تَبرَّكُم أبناؤكم، وعفُّوا تَعفَّ نساؤكم). حديث حسن رواه الطبراني.' },
          { Name: 'قال رسول الله صلى الله عليه وآله وصحبه وسلم: (البخيل من ذكرتُ عنده فلم يصلِّ عليَّ). حديث صحيح رواه الإمام أحمد.' }, { Name: 'قال رسول الله صلى الله عليه وآله وصحبه وسلم: (بين كلّ أذانين صلاةٌ لمن شاء). رواه البخاري ومسلم.' },
          { Name: 'قال رسول الله صلى الله عليه وآله وصحبه وسلم: (التاجر الأمين الصدوق المسلم مع الشهداء يوم القيامة). حديث صحيح رواه الحاكم.' },
          { Name: 'قال رسول الله صلى الله عليه وآله وصحبه وسلم: (ثلاثة لا ترفع صلاتهم فوق رؤوسهم شبراً: رجل أمَّ قوماً و هم له كارهون، و امرأة باتت وزوجها عليها ساخط، وأخوان متصارمان). حديث حسن رواه ابن ماجه.' },
          { Name: 'قال رسول الله صلى الله عليه وآله وصحبه وسلم: (جالسوا الكبراء، وسائلوا العلماء، وخالطوا الحكماء). حديث صحيح رواه الطبراني.' },
          { Name: 'قال رسول الله صلى الله عليه وآله وصحبه وسلم: (جاهدوا المشركين بأموالكم وأنفسكم وألسنتكم). حديث صحيح رواه أحمد.' },
          { Name: 'قال رسول الله صلى الله عليه وآله وصحبه وسلم: (جددوا إيمانكم أكثروا من قول: لا إله إلا الله). حديث صحيح رواه أحمد.' },
          { Name: 'قال رسول الله صلى الله عليه وآله وصحبه وسلم: (حب الدنيا رأس كلّ خطيئة). رواه البيهقي.' },
          { Name: 'قال رسول الله صلى الله عليه وآله وصحبه وسلم: (حُفَّت الجنة بالمكاره وحُفَّت النار بالشهوات). رواه مسلم.' },
          { Name: 'قال رسول الله صلى الله عليه وآله وصحبه وسلم: (خمس من حق المسلم على المسلم: رد التحية، وإجابة الدعوة، وشهود الجنازة، وعيادة المريض، وتشميت العاطس إذا حمد الله). حديث صحيح رواه ابن ماجه.' },
          { Name: 'قال رسول الله صلى الله عليه وآله وصحبه وسلم: (خياركم أحاسِـنُكم أخلاقاً). رواه البخاري ومسلم.' }


          , { Name: 'قال رسول الله صلى الله عليه وآله وصحبه وسلم: (خيركم من تعلم القرآنَ وعلَّمه). رواه البخاري.' },
          { Name: 'قال رسول الله صلى الله عليه وآله وصحبه وسلم: (الخَلْق كلُّهم عيال الله فأحبُّهم إلى الله أنفُعهم لعياله). رواه أبو يعلي.' },
          { Name: 'قال رسول الله صلى الله عليه وآله وصحبه وسلم: (دع ما يريبك إلى ما لا يريبك). حديث صحيح رواه النَّسائي.' },
          { Name: 'قال رسول الله صلى الله عليه وآله وصحبه وسلم: (الدعاء بين الأذان والإقامة مستجاب فادعوا). حديث صحيح رواه أبو يعلي.' },
          { Name: 'قال رسول الله صلى الله عليه وآله وصحبه وسلم: (ذاق طعمَ الإيمان من رضي بالله رباً، وبالإسلام ديناً، وبمحمد رسولاً). رواه مسلم' },
          { Name: 'قال رسول الله صلى الله عليه وآله وصحبه وسلم: (رُبَّ أشعثَ مدفوع بالأبواب؛ لو أقسم على الله لأبرَّه). رواه مسلم.' },
          { Name: 'قال رسول الله صلى الله عليه وآله وصحبه وسلم: (ركعتا الفجر خير من الدنيا وما فيها). رواه الترمذي.' },
          { Name: 'قال رسول الله صلى الله عليه وآله وصحبه وسلم: (ركعتان بسواك خير من سبعين ركعة بغير سواك). رواه الدارَقطني.' },
          { Name: 'قال رسول الله صلى الله عليه وآله وصحبه وسلم: (الراحمون يرحمهم الرحمن تبارك وتعالى، ارحموا من في الأرض يرحمكم من في السماء). حديث صحيح رواه أحمد.' },
          { Name: 'قال رسول الله صلى الله عليه وآله وصحبه وسلم: (زوروا القبور فإنها تذكركُم الآخرةَ). رواه ابن ماجه.' },
          { Name: 'قال رسول الله صلى الله عليه وآله وصحبه وسلم: (زينوا القرآن بأصواتكم). رواه مسلم.' },
          { Name: 'قال رسول الله صلى الله عليه وآله وصحبه وسلم: (سورة تبارك هي المانعة من عذاب القبر). حديث حسن رواه ابن مردويه.' },
          { Name: 'قال رسول الله صلى الله عليه وآله وصحبه وسلم: (شفاعتي لأهل الكبائر من أمتي). حديث حسن رواه أحمد.' },
          { Name: 'قال رسول الله صلى الله عليه وآله وصحبه وسلم: (صدقة السر تطفئ غضب الرب). حديث حسن رواه الطبراني.' },
          { Name: 'قال رسول الله صلى الله عليه وآله وصحبه وسلم: (صلاة الجماعة تفضل صلاة الفذِّ بسبع وعشرين درجة). رواه البخاري ومسلم.' },
          { Name: 'قال رسول الله صلى الله عليه وآله وصحبه وسلم: (طعام الاثنين كافي الثلاثة، و طعام الثلاثة كافي الأربعة). رواه البخاري ومسلم.' },



        ],
      }
    }
  }

  Array(index) {
    let new_in = this.state.Arr
    if (new_in[index].Open == true) {
      new_in[index].Open = false
    } else {
      for (var i = 0; i < new_in.length; i++) {
        new_in[i].Open = false
      }
      new_in[index].Open = true

    }


    this.setState({ Arr: new_in })
  }





  render() {
    return (
      <>
        <StatusBar backgroundColor="#0c0c0c" />

        <ImageBackground source={require('../img/22.jpg')}
          style={{
            height: height,
            width: width,
            justifyContent: "flex-start",
            alignItems: "flex-start",
          }}
          resizeMode={'cover'}>



          <View style={{
            flex: 1,
          }}>

            {/* <View style={{
              width: width,
              justifyContent: "center",
              alignItems: "center"
            }}>

              <Text style={{
                fontSize: 20,
                padding: 10,
                color: "#fff"
              }}>الأذكار</Text>



            </View> */}





            {/* <View
                  style={{
                    justifyContent: "center",
                    alignItems: "center",
                    alignSelf: "center",
                    padding: 10,
                    paddingHorizontal:50,
                    borderRadius: 20,
                    backgroundColor: "#bbbbbb",
                    marginTop: 5
                  }}>

                  <Text style={{
                    fontSize: 20,
                    color: COLORS.background
                  }}>الأذكار</Text>

                </View> */}

            <ScrollView>
              {this.state.Arr1.map((item, index) => (


                <Animatable.View
                  animation={"fadeInRightBig"}>

                  <View
                    onPress={() => { this.Array(index) }}
                    style={{
                      justifyContent: "center",
                      alignItems: "center",
                      alignSelf: "center",
                      padding: 10,
                      paddingHorizontal: 50,
                      borderRadius: 20,
                      backgroundColor: "#bbbbbb",
                      marginTop: 5
                    }}>
  
                    <Text style={{
                      fontSize: 20,
                      color: COLORS.background
                      }}>{item.levels}</Text>

                  </View>



                  {item.poem.map((items, index) =>

                    <View style={{
                      padding: 20,
                      backgroundColor: "#9e653b",
                      borderRadius: 10,
                      marginTop: 5,
                      marginHorizontal: 10,
                      flexDirection: "row",
                      justifyContent: 'center',
                    }}>
                      <Text style={{
                        fontSize: 15,
                        color: "#000",

                      }}> . {index + 1}</Text>


                      <Text style={{
                        fontSize: 15,
                        color: "#000",
                      }}>{items.Name}</Text>
                    </View>
                  )}




                </Animatable.View>
              ))}
              <View style={{ height: 60, width: width }}></View>

            </ScrollView>

          </View>
        </ImageBackground>



      </>
    )
  }
}
