import * as React from 'react';
import {
    Text,
    StyleSheet,
    View,
    Button,
    TouchableOpacity,
    Image,
    ScrollView,
    ImageBackground,
    StatusBar,
    TextInput,
    Dimensions,
    Modal,
    AsyncStorage
} from 'react-native';
import FontAwesome5 from 'react-native-vector-icons/FontAwesome5';
import AntDesign from 'react-native-vector-icons/AntDesign';
import * as Animatable from 'react-native-animatable';
import { COLORS } from '../constants';
const { width, height } = Dimensions.get('window');


export default class Doaa extends React.Component {


    constructor() {
        super(); {
            this.state = {
                Arr: [
                    {
                        levels: 'أدعية القرآن الكريم كاملا',
                        Open: false, view: true,
                        poem: [
                            { Name: '"اهْدِنَا الصِّرَاطَ الْمُسْتَقِيمَ * صِرَاطَ الَّذِينَ أَنْعَمْتَ عَلَيْهِمْ غَيْرِ الْمَغْضُوبِ عَلَيْهِمْ وَلَا الضَّالِّينَ" [الفاتحة: 6، 7].' }, { Name: '"رَبَّنَا تَقَبَّلْ مِنَّا إِنَّكَ أَنْتَ السَّمِيعُ الْعَلِيمُ " [البقرة: 127].' },
                            { Name: '" رَبَّنَا آتِنَا فِي الدُّنْيَا حَسَنَةً وَفِي الْآخِرَةِ حَسَنَةً وَقِنَا عَذَابَ النَّارِ " [البقرة: 201].' },
                            { Name: '" رَبَّنَا أَفْرِغْ عَلَيْنَا صَبْرًا وَثَبِّتْ أَقْدَامَنَا وَانْصُرْنَا عَلَى الْقَوْمِ الْكَافِرِينَ " [البقرة: 250].' },
                            { Name: '" رَبَّنَا لَا تُؤَاخِذْنَا إِنْ نَسِينَا أَوْ أَخْطَأْنَا " [البقرة: 286].' },
                            { Name: '" رَبَّنَا وَلَا تَحْمِلْ عَلَيْنَا إِصْرًا كَمَا حَمَلْتَهُ عَلَى الَّذِينَ مِنْ قَبْلِنَا " [البقرة: 286].' },
                            { Name: '" رَبَّنَا وَلَا تُحَمِّلْنَا مَا لَا طَاقَةَ لَنَا بِهِ وَاعْفُ عَنَّا وَاغْفِرْ لَنَا وَارْحَمْنَا أَنْتَ مَوْلَانَا فَانْصُرْنَا عَلَى الْقَوْمِ الْكَافِرِينَ " [البقرة: 286].' },
                            { Name: '" رَبَّنَا لَا تُزِغْ قُلُوبَنَا بَعْدَ إِذْ هَدَيْتَنَا وَهَبْ لَنَا مِنْ لَدُنْكَ رَحْمَةً إِنَّكَ أَنْتَ الْوَهَّابُ " [آل عمران: 8].' },
                            { Name: '" رَبَّنَا إِنَّنَا آمَنَّا فَاغْفِرْ لَنَا ذُنُوبَنَا وَقِنَا عَذَابَ النَّارِ " [آل عمران: 16].' },
                            { Name: '" رَبِّ هَبْ لِي مِنْ لَدُنْكَ ذُرِّيَّةً طَيِّبَةً إِنَّكَ سَمِيعُ الدُّعَاءِ " [آل عمران: 38].' },
                            { Name: '" رَبَّنَا آمَنَّا بِمَا أَنْزَلْتَ وَاتَّبَعْنَا الرَّسُولَ فَاكْتُبْنَا مَعَ الشَّاهِدِينَ " [آل عمران: 53].' },
                            { Name: '" رَبَّنَا اغْفِرْ لَنَا ذُنُوبَنَا وَإِسْرَافَنَا فِي أَمْرِنَا وَثَبِّتْ أَقْدَامَنَا وَانْصُرْنَا عَلَى الْقَوْمِ الْكَافِرِينَ " [آل عمران: 147].' },
                            { Name: '" حَسْبُنَا اللَّهُ وَنِعْمَ الْوَكِيلُ " [آل عمران: 173].' },
                            { Name: '" رَبَّنَا مَا خَلَقْتَ هَذَا بَاطِلًا سُبْحَانَكَ فَقِنَا عَذَابَ النَّارِ " [آل عمران: 191].' },
                            { Name: '" رَبَّنَا إِنَّنَا سَمِعْنَا مُنَادِيًا يُنَادِي لِلْإِيمَانِ أَنْ آمِنُوا بِرَبِّكُمْ فَآمَنَّا رَبَّنَا فَاغْفِرْ لَنَا ذُنُوبَنَا وَكَفِّرْ عَنَّا سَيِّئَاتِنَا وَتَوَفَّنَا مَعَ الْأَبْرَارِ " [آل عمران: 193].' },
                            { Name: '" رَبَّنَا وَآتِنَا مَا وَعَدْتَنَا عَلَى رُسُلِكَ وَلَا تُخْزِنَا يَوْمَ الْقِيَامَةِ إِنَّكَ لَا تُخْلِفُ الْمِيعَادَ " [آل عمران: 194].' },
                            { Name: '" وَاجْعَلْ لَنَا مِنْ لَدُنْكَ وَلِيًّا وَاجْعَلْ لَنَا مِنْ لَدُنْكَ نَصِيرًا " [النساء: 75].' },
                            { Name: '" وَارْزُقْنَا وَأَنْتَ خَيْرُ الرَّازِقِينَ " [المائدة: 114].' },
                            { Name: '" رَبَّنَا ظَلَمْنَا أَنْفُسَنَا وَإِنْ لَمْ تَغْفِرْ لَنَا وَتَرْحَمْنَا لَنَكُونَنَّ مِنَ الْخَاسِرِينَ " [الأعراف: 23].' },
                            { Name: '" رَبَّنَا افْتَحْ بَيْنَنَا وَبَيْنَ قَوْمِنَا بِالْحَقِّ وَأَنْتَ خَيْرُ الْفَاتِحِينَ " [الأعراف: 89].' },
                            { Name: '" رَبَّنَا أَفْرِغْ عَلَيْنَا صَبْرًا وَتَوَفَّنَا مُسْلِمِينَ " [الأعراف: 126].' },
                            { Name: '" فَلَا تُشْمِتْ بِيَ الْأَعْدَاءَ وَلَا تَجْعَلْنِي مَعَ الْقَوْمِ الظَّالِمِينَ " [الأعراف: 150].' },
                            { Name: '" وَأَدْخِلْنَا فِي رَحْمَتِكَ وَأَنْتَ أَرْحَمُ الرَّاحِمِينَ " [الأعراف: 151].' },
                            { Name: '" أَنْتَ وَلِيُّنَا فَاغْفِرْ لَنَا وَارْحَمْنَا وَأَنْتَ خَيْرُ الْغَافِرِينَ " [الأعراف: 155].' },
                            { Name: ' " رَبَّنَا لَا تَجْعَلْنَا فِتْنَةً لِلْقَوْمِ الظَّالِمِينَ * وَنَجِّنَا بِرَحْمَتِكَ مِنَ الْقَوْمِ الْكَافِرِينَ " [يونس: 85، 86].' },
                            { Name: '" فَاطِرَ السَّمَاوَاتِ وَالْأَرْضِ أَنْتَ وَلِيِّي فِي الدُّنْيَا وَالْآخِرَةِ تَوَفَّنِي مُسْلِمًا وَأَلْحِقْنِي بِالصَّالِحِينَ " [يوسف: 101].' },
                            { Name: ' " رَبِّ اجْعَلْنِي مُقِيمَ الصَّلَاةِ وَمِنْ ذُرِّيَّتِي رَبَّنَا وَتَقَبَّلْ دُعَاءِ " [إبراهيم: 40].' },
                            { Name: '" رَبَّنَا اغْفِرْ لِي وَلِوَالِدَيَّ وَلِلْمُؤْمِنِينَ يَوْمَ يَقُومُ الْحِسَابُ " [إبراهيم: 41].' },
                            { Name: '" رَبِّ ارْحَمْهُمَا كَمَا رَبَّيَانِي صَغِيرًا " [الإسراء: 24].' },
                            { Name: '" رَبِّ أَدْخِلْنِي مُدْخَلَ صِدْقٍ وَأَخْرِجْنِي مُخْرَجَ صِدْقٍ وَاجْعَلْ لِي مِنْ لَدُنْكَ سُلْطَانًا نَصِيرًا " [الإسراء: 80].' },
                            { Name: '" رَبَّنَا آتِنَا مِنْ لَدُنْكَ رَحْمَةً وَهَيِّئْ لَنَا مِنْ أَمْرِنَا رَشَدًا " [الكهف: 10].' },
                            { Name: '" رَبِّ اشْرَحْ لِي صَدْرِي * وَيَسِّرْ لِي أَمْرِي " [طه: 25، 26].' },
                            { Name: '" رَبِّ زِدْنِي عِلْمًا " [طه: 114].' },
                            { Name: '" لَا إِلَهَ إِلَّا أَنْتَ سُبْحَانَكَ إِنِّي كُنْتُ مِنَ الظَّالِمِينَ " [الأنبياء: 87].' },
                            { Name: '" رَبِّ لَا تَذَرْنِي فَرْدًا وَأَنْتَ خَيْرُ الْوَارِثِينَ " [الأنبياء: 89].' },
                            { Name: '" رَبِّ أَنْزِلْنِي مُنْزَلًا مُبَارَكًا وَأَنْتَ خَيْرُ الْمُنْزِلِينَ " [المؤمنون: 29].' },
                            { Name: '" رَبِّ أَعُوذُ بِكَ مِنْ هَمَزَاتِ الشَّيَاطِينِ * وَأَعُوذُ بِكَ رَبِّ أَنْ يَحْضُرُونِ " [المؤمنون: 97، 98].' },
                            { Name: '" رَبَّنَا آمَنَّا فَاغْفِرْ لَنَا وَارْحَمْنَا وَأَنْتَ خَيْرُ الرَّاحِمِينَ " [المؤمنون: 109].' },
                            { Name: '" رَبِّ اغْفِرْ وَارْحَمْ وَأَنْتَ خَيْرُ الرَّاحِمِينَ " [المؤمنون: 118].' },
                            { Name: '" رَبَّنَا اصْرِفْ عَنَّا عَذَابَ جَهَنَّمَ إِنَّ عَذَابَهَا كَانَ غَرَامًا * إِنَّهَا سَاءَتْ مُسْتَقَرًّا وَمُقَامًا " [الفرقان: 65، 66].' },
                            { Name: '" رَبَّنَا هَبْ لَنَا مِنْ أَزْوَاجِنَا وَذُرِّيَّاتِنَا قُرَّةَ أَعْيُنٍ وَاجْعَلْنَا لِلْمُتَّقِينَ إِمَامًا " [الفرقان: 74].' },
                            { Name: ' " وَاجْعَلْ لِي لِسَانَ صِدْقٍ فِي الْآخِرِينَ * وَاجْعَلْنِي مِنْ وَرَثَةِ جَنَّةِ النَّعِيمِ " [الشعراء: 84، 85].' },
                            { Name: ' " وَلَا تُخْزِنِي يَوْمَ يُبْعَثُونَ * يَوْمَ لَا يَنْفَعُ مَالٌ وَلَا بَنُونَ * إِلَّا مَنْ أَتَى اللَّهَ بِقَلْبٍ سَلِيمٍ " [الشعراء: 87 - 89].' },
                            { Name: '" رَبِّ إِنِّي ظَلَمْتُ نَفْسِي فَاغْفِرْ لِي " [القصص: 16].' },
                            { Name: '" رَبِّ نَجِّنِي مِنَ الْقَوْمِ الظَّالِمِينَ " [القصص: 21].' },
                            { Name: ' " رَبِّ إِنِّي لِمَا أَنْزَلْتَ إِلَيَّ مِنْ خَيْرٍ فَقِيرٌ " [القصص: 24].' },
                            { Name: '" رَبِّ انْصُرْنِي عَلَى الْقَوْمِ الْمُفْسِدِينَ " [العنكبوت: 30].' },
                            { Name: ' " رَبِّ هَبْ لِي مِنَ الصَّالِحِينَ " [الصافات: 100].' },
                            { Name: '" رَبَّنَا وَسِعْتَ كُلَّ شَيْءٍ رَحْمَةً وَعِلْمًا فَاغْفِرْ لِلَّذِينَ تَابُوا وَاتَّبَعُوا سَبِيلَكَ وَقِهِمْ عَذَابَ الْجَحِيمِ " [غافر: 7].' },
                            { Name: ' " رَبَّنَا وَأَدْخِلْهُمْ جَنَّاتِ عَدْنٍ الَّتِي وَعَدْتَهُمْ وَمَنْ صَلَحَ مِنْ آبَائِهِمْ وَأَزْوَاجِهِمْ وَذُرِّيَّاتِهِمْ إِنَّكَ أَنْتَ الْعَزِيزُ الْحَكِيمُ * وَقِهِمُ السَّيِّئَاتِ وَمَنْ تَقِ السَّيِّئَاتِ يَوْمَئِذٍ فَقَدْ رَحِمْتَهُ وَذَلِكَ هُوَ الْفَوْزُ الْعَظِيمُ " [غافر: 8، 9].' },
                            { Name: '" رَبَّنَا اكْشِفْ عَنَّا الْعَذَابَ إِنَّا مُؤْمِنُونَ " [الدخان: 12].' },
                            { Name: '" رَبِّ أَوْزِعْنِي أَنْ أَشْكُرَ نِعْمَتَكَ الَّتِي أَنْعَمْتَ عَلَيَّ وَعَلَى وَالِدَيَّ وَأَنْ أَعْمَلَ صَالِحًا تَرْضَاهُ وَأَصْلِحْ لِي فِي ذُرِّيَّتِي إِنِّي تُبْتُ إِلَيْكَ وَإِنِّي مِنَ الْمُسْلِمِينَ " [الأحقاف: 15].' },
                            { Name: '" رَبَّنَا اغْفِرْ لَنَا وَلِإِخْوَانِنَا الَّذِينَ سَبَقُونَا بِالْإِيمَانِ وَلَا تَجْعَلْ فِي قُلُوبِنَا غِلًّا لِلَّذِينَ آمَنُوا رَبَّنَا إِنَّكَ رَءُوفٌ رَحِيمٌ " [الحشر: 10].' },
                            { Name: ' " رَبَّنَا عَلَيْكَ تَوَكَّلْنَا وَإِلَيْكَ أَنَبْنَا وَإِلَيْكَ الْمَصِيرُ " [الممتحنة: 4].' },
                            { Name: ' " رَبَّنَا لَا تَجْعَلْنَا فِتْنَةً لِلَّذِينَ كَفَرُوا وَاغْفِرْ لَنَا رَبَّنَا إِنَّكَ أَنْتَ الْعَزِيزُ الْحَكِيمُ " [الممتحنة: 5].' },
                            { Name: '" رَبَّنَا أَتْمِمْ لَنَا نُورَنَا وَاغْفِرْ لَنَا إِنَّكَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ " [التحريم: 8].' },
                            { Name: '" رَبِّ ابْنِ لِي عِنْدَكَ بَيْتًا فِي الْجَنَّةِ " [التحريم: 11].' },
                            { Name: '" رَبِّ اغْفِرْ لِي وَلِوَالِدَيَّ " [نوح: 28].' },


                        ]
                    },

                    {
                        levels: " عند رؤية هلال رمضان",
                        Open: false, view: true,
                        poem: [
                            { Name: "اللَّهُمَّ أَهْلِلْهُ عَلَيْنَا بِالْيُمْنِ وَالإِيمَانِ وَالسَّلاَمَةِ وَالإِسْلاَمِ رَبِّي وَرَبُّكَ اللَّهُ" }
                        ]
                    },
                    {
                        levels: "عند بدأ الصيام - السحور ",
                        Open: false, view: true,
                        poem: [
                            { Name: "بِسْمِ اللَّه" }, { Name: "وَبِصَوْمِ غَدٍ نَّوَيْتُ مِنْ شَهْرِ رَمَضَانَ" }
                        ]
                    },
                    {
                        levels: "عند بدأ الصيام",
                        Open: false, view: true,
                        poem: [
                            { Name: "ذَهَبَ الظَّمَأُ وَابْتَلَّتِ الْعُرُوقُ وَثَبَتَ الأَجْرُ إِنْ شَاءَ اللَّهُ" }, { Name: "اللَّهُمَّ لَكَ صُمْتُ وَعَلَى رِزْقِكَ أَفْطَرْتُ" }
                        ]
                    },
                    {
                        levels: "الدُعاء للشخص الذي يجلب لك الإفطار ",
                        Open: false, view: true,
                        poem: [
                            { Name: "أَفْطَرَ عِنْدَكُمُ الصَّائِمُونَ وَأَكَلَ طَعَامَكُمُ الأَبْرَارُ وَصَلَّتْ عَلَيْكُمُ الْمَلاَئِكَةُ" }
                        ]
                    },
                    {
                        levels: "الاول عشرة رمضان",
                        Open: false, view: true,
                        poem: [
                            { Name: "يَا حَيُّ يَا قَيُّومُ بِرَحْمَتِكَ أَسْتَغيثُ" }
                        ]
                    },
                    {
                        levels: "ثاني عشر رمضان",
                        Open: false, view: true,
                        poem: [
                            { Name: "اَسْتَغْفِرُ اللہَ رَبِّی مِنْ کُلِّ زَنْبٍ وَّ اَتُوْبُ اِلَیْہِ" }
                        ]
                    }, {
                        levels: "آخرعشر رمضان",
                        Open: false, view: true,
                        poem: [
                            { Name: "اَللَّهُمَّ أَجِرْنِي مِنَ النَّارِ" }
                        ]
                    },
                    {
                        levels: "ليلة القدر",
                        Open: false, view: true,
                        poem: [
                            { Name: "اللَّهُمَّ إِنَّكَ عَفُوٌّ كَرِيمٌ تُحِبُّ الْعَفْوَ فَاعْفُ عَنِّي" }
                        ]
                    },
                    {
                        levels: "قبل دخول الخلاء",
                        Open: false, view: true,
                        poem: [
                            { Name: "(بِسْمِ اللَّهِ). اللَّهُـمَّ إِنِّي أَعُـوذُ بِـكَ مِـنَ الْخُـبْثِ وَالْخَبَائِثِ." }
                        ]
                    },
                    {
                        levels: "عند الخروج من الخلاء",
                        Open: false, view: true,
                        poem: [
                            { Name: "غُفْرَانَكَ" }
                        ]
                    },
                    {
                        levels: "قبل النوم",
                        Open: false, view: true,
                        poem: [
                            { Name: "بِاسْمِكَ رَبِّي وَضَعْتُ جَنْبِي، وَبِكَ أَرْفَعُهُ، فَإِنْ أَمْسَكْتَ نَفْسِي فَارْحَمْهَا، وَإِنْ أَرْسَلْتَهَا فَاحْفَظْهَا، بِمَا تَحْفَظُ بِهِ عِبَادَكَ الصَّالِحِينَ." }
                        ]
                    },
                    {
                        levels: "بعد تناول الطعام",
                        Open: false, view: true,
                        poem: [
                            { Name: "الْحَمْدُ لِلَّهِ الَّذِى اطْعَمَنَا وَسَقَانَا ، وَجَعَلنَا مُسْلِمِينَ" }
                        ]
                    },
                    {
                        levels: "عند نزول المطر",
                        Open: false, view: true,
                        poem: [
                            { Name: "مُطِرْنَا بِفَضْلِ اللهِ وَ رَحْمَتِهِ" }, { Name: "اللّهُمَّ صَيِّـباً نافِـعاً" },
                            { Name: "اللّهُمَّ حَوالَيْنا وَلا عَلَيْـنَا، اللّهُمَّ عَلى الآكَـامِ وَالظِّـرابِ، وَبُطُـونِِ الأوْدِيةِ، وَمَنـابِِتِ الشَّجَـرِ" }
                        ]
                    },
                    {
                        levels: "بعد صلاة التسبيح",
                        Open: false, view: true,
                        poem: [
                            { Name: "سُبْحَانَ اللَّه (33 times) اَلْحَمْدُ لِلَّه (33 times) اَللَّهُ أَكْبَر (34 times)" }
                        ]
                    },
                    {
                        levels: "بعد التكبير (بداية الصلاة) ",
                        Open: false, view: true,
                        poem: [
                            { Name: "وَجَّهْتُ وَجْهِيَ لِلَّذِي فَطَرَ السَّموَاتِ وَالْأَرْضَ حَنِيفاً وَمَا أَنَا مِنَ الْمُشْرِكِينَ، إِنَّ صَلَاتِي، وَنُسُكِي، وَمَحْيَايَ، وَمَمَاتِي للهِ رَبِّ الْعَالَمِينَ، لَا شَرِيكَ لَهُ وَبِذَلِكَ أُمِرْتُ وَأَنَا مِنَ الْمُسْلِمِينَ. اللَّهُمَّ أَنْتَ الْمَلِكُ لَا إِلَهَ إِلَّا أَنْتَ، أَنْتَ رَبِّي وَأَنَا عَبْدُكَ، ظَلَمْتُ نَفْسِي وَاعْتَرَفْتُ بَذَنْبِي فَاغْفِرْ لِي ذُنُوبِي جَمِيعاً إِنَّهُ لَا يَغْفِرُ الذُّنُوبَ إِلَّا أَنْتَ، وَاهْدِنِي لأّحْسَنِ الْأَخْلَاقِ لَا يَهْدِي لأَحْسَنِهَا إِلَّا أَنْتَ، وَاصْرِفْ عَنِّي سَيِّئَهَا لَا يَصْرِفُ عَنِّي سَيِّئَهَا إِلَّا أَنْتَ، لَبَّيْكَ وَسَعْدَيْكَ، وَالْخَيْرُ كُلُّهُ بِيَدَيْكَ، وَالشَّرُّ لَيْسَ إِلَيْكَ، أَنَا بِكَ وَإِلَيْكَ، تَبَارَكْتَ وَتَعَالَيْتَ، أَسْتَغْفِرُكَ وَأَتُوبُ إِلَيْكَ" }, { Name: "اللَّهُمَّ بَاعِدْ بَيْنِي وَبَيْنَ خَطَايَايَ كَمَا بَاعَدْتَ بَيْنَ الْمَشْرِقِ وَالْمَغْرِبِ، اللَّهُمَّ نَقِّنِي مِنْ خَطَايَايَ، كَمَا يُنَقَّى الثَّوْبُ الْأَ بْيَضُ مِنَ الدَّنَسِ، اللَّهُمَّ اغْسِلْنِي مِنْ خَطَايَايَ بِالثَّلْجِ وّالْمَاءِ وَالْبَرَدِ" },
                            { Name: "سُبْحَانَكَ اللَّهُمَّ وَبِحَمْدِكَ، وَتَبَارَكَ اسْمُكَ، وَتَعَالَى جَدُّكَ، وَلَا إِلَهَ غَيْرُكَ" }
                        ]
                    },
                    {
                        levels: "بعد التشهد",
                        Open: false, view: true,
                        poem: [
                            { Name: "اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ عَذَابِ الْقَبْرِ، وَأَعُوذُ بِكَ مِنْ فِتْنَةِ الْمَسِيحِ الدَّجَّالِ، وَأَعُوذُ بِكَ مِنْ فِتْنَةِ الْمَحْيَا وَالْمَمَاتِ. اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ الْمَأْثَمِ وَالْمَغْرَمِ" }, { Name: "اللَّهُمَّ إِنِّي ظَلَمْتُ نَفْسِي ظُلْماً كَثِيراً، وَلَا يَغْفِرُ الذُّنُوبَ إِلَّا أَنْتَ، فَاغْفِرْ لِي مَغْفِرَةً مِنْ عِنْدِكَ وَارْحَمْنِي إِنَّكَ أَنْتَ الْغَفُورُ الرَّحِيمُ" },
                            { Name: "اللَّهُمَّ اغْفِرْ لِي مَا قَدَّمْتُ وَمَا أَخَّرْتُ، وَمَا أَسْرَرْتُ، وَمَا أَعْلَنْتُ، وَمَا أَسْرَفْتُ، وَمَا أَنْتَ أَعْلَمُ بِهِ مِنِّي. أَنْتَ الْمُقَدِّمُ، وَأَنْتَ الْمُؤَخِّرُ لَا إِلهَ إِلَاَّ أَنْتَ" }
                        ]
                    },
                    {
                        levels: "دُعاء طلب أن يرزقك الله بالأطفال",
                        Open: false, view: true,
                        poem: [
                            { Name: "رَبِّ ھَبْ لِيْ مِنْ لَّدُنْكَ ذُرِّيَّةً طَيِّبَةً ۚ اِنَّكَ سَمِيْعُ الدُّعَاۗءِ" }, { Name: "رَبِّ لَا تَذَرْنِيْ فَرْدًا وَّاَنْتَ خَيْرُ الْوٰرِثِيْنَ" }
                        ]
                    },
                    {
                        levels: "عند جبل عرفات",
                        Open: false, view: true,
                        poem: [
                            { Name: "لَا إِلَهَ إِلَّا اللَّهُ وَحْدَهُ لَا شَرِيكَ لَهُ لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٍ" }
                        ]
                    },
                    {
                        levels: "عند الإنتهاء من المجلس",
                        Open: false, view: true,
                        poem: [
                            { Name: "سُبْحـانَكَ اللّهُـمَّ وَبِحَمدِك، أَشْهَـدُ أَنْ لا إِلهَ إِلاّ أَنْتَ أَسْتَغْفِرُكَ وَأَتوبُ إِلَـيْك" }
                        ]
                    },
                    {
                        levels: "في أوقات الشدة والقلق",
                        Open: false, view: true,
                        poem: [
                            { Name: "اللّهُـمَّ إِنِّي أَعْوذُ بِكَ مِنَ الهَـمِّ وَ الْحُـزْنِ، والعًجْـزِ والكَسَلِ والبُخْـلِ والجُـبْنِ، وضَلْـعِ الـدَّيْنِ وغَلَبَـةِ الرِّجال" }
                        ]
                    },
                    {
                        levels: "داوود وأبراهيم",
                        Open: false, view: true,
                        poem: [
                            { Name: "اللَّهُمَّ صَلِّ عَلَى مُحَمَّدٍ وَعَلَى آلِ مُحَمَّدٍ كَمَا صَلَّيْتَ عَلَى إِبْرَاهِيمَ وَعَلَى آلِ إِبْرَاهِيمَ، إِنَّكَ حَمِيدٌ مَجِيدٌ، اللَّهُمَّ بَارِكَ عَلَى مُحَمَّدٍ وَعَلَى آلِ مُحَمَّدٍ كَمَا بَارَكْتَ عَلَى إِبْرَاهِيمَ وَعَلَى آلِ إِبْرَاهِيمَ، إِنَّكَ حَمِيدٌ مَجِيدٌ" }
                        ]
                    },
                    {
                        levels: "دُعاء القنوط (الذي يُقال في صلاة الوتر) ",
                        Open: false, view: true,
                        poem: [
                            { Name: "اَللَّهُمَّ إنا نَسْتَعِينُكَ وَنَسْتَغْفِرُكَ وَنُؤْمِنُ بِكَ وَنَتَوَكَّلُ عَلَيْكَ وَنُثْنِئْ عَلَيْكَ الخَيْرَ وَنَشْكُرُكَ وَلَا نَكْفُرُكَ وَنَخْلَعُ وَنَتْرُكُ مَنْ ئَّفْجُرُكَ اَللَّهُمَّ إِيَّاكَ نَعْبُدُ وَلَكَ نُصَلِّئ وَنَسْجُدُ وَإِلَيْكَ نَسْعأئ وَنَحْفِدُ وَنَرْجُو رَحْمَتَكَ وَنَخْشآئ عَذَابَكَ إِنَّ عَذَابَكَ بِالكُفَّارِ مُلْحَقٌ" }
                        ]
                    },
                    {
                        levels: "عند حدوث عاصفة",
                        Open: false, view: true,
                        poem: [
                            { Name: "اللّهُـمَّ إِنَّـي أَسْـأَلُـكَ خَيْـرَها، وَأَعـوذُ بِكَ مِنْ شَـرِّها" }
                        ]
                    },
                    {
                        levels: "عند الركوع في الصلاة",
                        Open: false, view: true,
                        poem: [
                            { Name: "سُبْحَانَ رَبِّيَ الْعَظِيمِ" }, { Name: "سُبْحَانَكَ اللَّهُمَّ رَبَّنَا وَبِحَمْدِكَ اللَّهُمَّ اغْفِرْ لِي" },
                            { Name: "سُبُّوحٌ، قُدُوسٌ، رَبُّ الْمَلَائِكَةِ وَالرُّوحِ" }, { Name: "اللَّهُمَّ لَكَ رَكَعْتُ، وَبِكَ آمَنْتُ، وَلَكَ أَسْلَمْتُ خَشَعَ لَكَ سَمْعِي، وَبَصَرِي وَمُخِّي، وَعَظْمِي، وَعَصَبِي، وَمَا اسْتَقَلَّ بِهِ قَدَمِي" }, { Name: "سُبْحَانَ ذِي الْجَبَرُوتِ، وَالْمَلَكُوتِ، وَالْكِبْرِيَاءِ، وَالْعَظَمَةِ" }

                        ]
                    },
                    {
                        levels: "دعاء التوبة ",
                        Open: false, view: true,
                        poem: [
                            { Name: "أَسْتَغْفِرُ اللهَ الَّذِي لاَ إِلَهَ إلاَّ هُوَ الحَيُّ القَيّوُمُ وأَتُوبُ إِلَيهِ" }, { Name: "ذَٰلِكُمُ اللَّهُ رَبِّي عَلَيْهِ تَوَكَّلْتُ وَإِلَيْهِ أُنِيبُ" }
                        ]
                    },
                    {
                        levels: "دعاء الصحبة الصالحة",
                        Open: false, view: true,
                        poem: [
                            { Name: "فَاطِرَ السَّمَاوَاتِ وَالْأَرْضِ أَنْتَ وَلِيِّي فِي الدُّنْيَا وَالْآخِرَةِ ۖ تَوَفَّنِي مُسْلِمًا وَأَلْحِقْنِي بِالصَّالِحِينَ" }, { Name: "رَبَّنَا آمَنَّا فَاكْتُبْنَا مَعَ الشَّاهِدِينَ" },
                            { Name: "رَبَّنَا آمَنَّا فَاكْتُبْنَا مَعَ الشَّاهِدِينَ" }, { Name: "فَاطِرَ السَّمَاوَاتِ وَالْأَرْضِ أَنْتَ وَلِيِّي فِي الدُّنْيَا وَالْآخِرَةِ ۖ تَوَفَّنِي مُسْلِمًا وَأَلْحِقْنِي بِالصَّالِحِينَ" }
                        ]
                    },
                    {
                        levels: "دعاء الرزق",
                        Open: false, view: true,
                        poem: [
                            { Name: "اللَّهُمَّ إِنِّي أَسْأَلُكَ عِلْماً نَافِعاً، وَرِزْقاً طَيِّباً، وَعَمَلاً مُتَقَبَّلاً" }, { Name: "اللَّهُمَّ اغْفِرْ لِي، وَارْحَمْنِي، وَاهْدِنِي، وَاجْبُرْنِي، وَعَافِنِي، وَارْزُقْنِي، وَارْفَعْنِي" },
                            { Name: "اللَّهُمَّ إَنِّي أَسْأَلُكَ مِنْ فَضْلِكَ" }, { Name: "اللَّهُ لَطِيفٌ بِعِبَادِهِ يَرْزُقُ مَن يَشَاءُ ۖ وَهُوَ الْقَوِيُّ الْعَزِيزُ" },
                            { Name: "رَبَّنَا أَنزِلْ عَلَيْنَا مَآئِدَةً مِّنَ السَّمَاء تَكُونُ لَنَا عِيداً لِّأَوَّلِنَا وَآخِرِنَا وَآيَةً مِّنكَ وَارْزُقْنَا وَأَنتَ خَيْرُ الرَّازِقِينَ" }, { Name: "رَبَّنَا أَنزِلْ عَلَيْنَا مَآئِدَةً مِّنَ السَّمَاء تَكُونُ لَنَا عِيداً لِّأَوَّلِنَا وَآخِرِنَا وَآيَةً مِّنكَ وَارْزُقْنَا وَأَنتَ خَيْرُ الرَّازِقِينَ" },
                            { Name: "اللَّهُ لَطِيفٌ بِعِبَادِهِ يَرْزُقُ مَن يَشَاءُ ۖ وَهُوَ الْقَوِيُّ الْعَزِيزُ" }
                        ]
                    },
                    {
                        levels: "لطلب العون من الله",
                        Open: false, view: true,
                        poem: [
                            { Name: "حَسْبُـنا اللهُ وَنِعْـمَ الوَكـيل" }, { Name: "إِنَّمَا أَشْكُو بَثِّي وَحُزْنِي إِلَى اللَّهِ وَأَعْلَمُ مِنَ اللَّهِ مَا لَا تَعْلَمُونَ" }
                        ]
                    },
                    {
                        levels: "الدُعاء للشخص الذي يقرضك المال ",
                        Open: false, view: true,
                        poem: [
                            { Name: "بارَكَ اللهُ لَكَ في أَهْلِكَ وَمالِك، إِنَّما جَـزاءُ السَّلَفِ الْحَمْدُ والأَدَاء" }
                        ]
                    },
                    {
                        levels: "الدعاء للنجاح",
                        Open: false, view: true,
                        poem: [
                            { Name: "وَمَا تَوْفِيقِي إِلَّا بِاللَّهِ ۚ عَلَيْهِ تَوَكَّلْتُ وَإِلَيْهِ أُنِيبُ" }
                        ]
                    },
                    {
                        levels: "الدُعاء للمتوفى في صلاة الجنازة",
                        Open: false, view: true,
                        poem: [
                            { Name: "اللهُـمِّ اغْفِـرْ لَهُ وَارْحَمْـه ، وَعافِهِ وَاعْفُ عَنْـه ، وَأَكْـرِمْ نُزُلَـه ، وَوَسِّـعْ مُدْخَـلَه ، وَاغْسِلْـهُ بِالْمـاءِ وَالثَّـلْجِ وَالْبَـرَدْ ، وَنَقِّـهِ مِنَ الْخطـايا كَما نَـقّيْتَ الـثَّوْبُ الأَبْيَـضُ مِنَ الدَّنَـسْ ، وَأَبْـدِلْهُ داراً خَـيْراً مِنْ دارِه ، وَأَهْلاً خَـيْراً مِنْ أَهْلِـه ، وَزَوْجَـاً خَـيْراً مِنْ زَوْجِه، وَأَدْخِـلْهُ الْجَـنَّة ، وَأَعِـذْهُ مِنْ عَذابِ القَـبْر وَعَذابِ النّـار" }, { Name: "اللهُـمِّ اغْفِـرْ لِحَيِّـنا وَمَيِّتِـنا وَشـاهِدِنا ، وَغائِبِـنا ، وَصَغيـرِنا وَكَبيـرِنا ، وَذَكَـرِنا وَأُنْثـانا . اللهُـمِّ مَنْ أَحْيَيْـتَهُ مِنّا فَأَحْيِـهِ عَلى الإِسْلام ،وَمَنْ تَوَفَّـيْتََهُ مِنّا فَتَوَفَّـهُ عَلى الإِيـمان ، اللهُـمِّ لا تَحْـرِمْنـا أَجْـرَه ، وَلا تُضِـلَّنا بَعْـدَهُ" },
                            { Name: "الَّلهُـمِّ إِنَّ فُلانَ بْنَ فُلانٍ في ذِمَّـتِك ، وَحَبْـلِ جِـوارِك ، فَقِـهِ مِنْ فِتْـنَةِ الْقَـبْرِ وَعَذابِ النّـار ، وَأَنْتَ أَهْلُ الْوَفـاءِ وَالْـحَقِّ ، فَاغْفِـرْ لَهُ وَارْحَمْـهُ ، إِنَّكَ أَنْتَ الغَـفورُ الـرَّحيم" }
                        ]
                    },
                    {
                        levels: "دعاء السفر",
                        Open: false, view: true,
                        poem: [
                            { Name: "سُبْحَانَ الَّذِي سَخَّرَ لَنَا هَذَا وَمَا كُنَّا لَهُ مُقْرِنِينَ وَإِنَّا إِلَى رَبِّنَا لَمُنْقَلِبُونَ" }, { Name: "رَّبِّ اَدْخِلْنِيْ مُدْخَلَ صِدْقٍ وَّاَخْرِجْنِيْ مُخْــرَجَ صِدْقٍ وَّاجْعَلْ لِّيْ مِنْ لَّدُنْكَ سُلْطٰنًا نَّصِيْرًا" }
                        ]
                    },
                    {
                        levels: "دعاء المغفرة لوالديك ولجميع المسلمين",
                        Open: false, view: true,
                        poem: [
                            { Name: "رَبَّنَا اغْفِرْ لِي وَلِوَالِدَيَّ وَلِلْمُؤْمِنِينَ يَوْمَ يَقُومُ الْحِسَابُ" }
                        ]
                    },
                    {
                        levels: "الدعاء لأخوتك",
                        Open: false, view: true,
                        poem: [
                            { Name: "رَبِّ اغْفِرْ لِي وَلِأَخِي وَأَدْخِلْنَا فِي رَحْمَتِكَ ۖ وَأَنْتَ أَرْحَمُ الرَّاحِمِينَ" }
                        ]
                    },
                    {
                        levels: "عندما تمر بأوقات عصيبة",
                        Open: false, view: true,
                        poem: [
                            { Name: "أَنِّي مَسَّنِيَ الضُّرُّ وَأَنتَ أَرْحَمُ الرَّاحِمِينَ" }, { Name: " إلهَ إلاّ اللّهُ وَاللّهُ أَكْبَـر، لا إلهَ إلاّ اللّهُ وحْـدَهُ , لا إلهَ إلاّ اللّهُ وحْـدَهُ لا شَريكَ لهُ، لا إلهَ إلاّ اللّهُ لهُ المُلكُ ولهُ الحَمْد، لا إلهَ إلاّ اللّهُ وَلا حَـوْلَ وَلا قُـوَّةَ إِلاّ بِالله" }
                        ]
                    },
                    {
                        levels: "عند اللحظات الأخيرة في حياة الإنسان",
                        Open: false, view: true,
                        poem: [
                            { Name: "أللّهُـمَّ اغْفِـرْ لي وَارْحَمْـني وَأَلْحِقْـني بِالرَّفـيقِ الأّعْلـى" }
                        ]
                    },
                    {
                        levels: "في أوقات السعادة",
                        Open: false, view: true,
                        poem: [
                            { Name: "سُبْحَانَ اللهِ اللهُ أَكْبرُ" }
                        ]
                    },
                    {
                        levels: "دعاء زيادة المعرفة",
                        Open: false, view: true,
                        poem: [
                            { Name: "رَّبِّ زِدْنِيْ عِلْمًا" }, { Name: "اللَّهُمَّ إِنِّي أَسْأَلُكَ عِلْماً نَافِعاً، وَرِزْقاً طَيِّباً، وَعَمَلاً مُتَقَبَّلاً" }
                            , { Name: "رَبِّ هَبْ لِي حُكْمًا وَأَلْحِقْنِي بِالصَّالِحِينَ وَاجْعَل لِّي لِسَانَ صِدْقٍ فِي الْآخِرِينَ وَاجْعَلْنِي مِن وَرَثَةِ جَنَّةِ النَّعِيمِ وَاغْفِرْ لِأَبِي إِنَّهُ كَانَ مِنَ الضَّالِّينَ وَلَا تُخْزِنِي يَوْمَ يُبْعَثُونَ يَوْمَ لَا يَنفَعُ مَالٌ وَلَا بَنُونَ إِلَّا مَنْ أَتَى اللَّهَ بِقَلْبٍ سَلِيمٍ" }
                        ]
                    },

                    {
                        levels: "لإقامة الصلاة بشكل منتظم",
                        Open: false, view: true,
                        poem: [
                            { Name: "إِنَّ رَبِّي لَسَمِيعُ الدُّعَاءِ رَبِّ اجْعَلْنِي مُقِيمَ الصَّلَاةِ وَمِنْ ذُرِّيَّتِي ۚ رَبَّنَا وَتَقَبَّلْ دُعَاءِ" }
                        ]
                    },
                    {
                        levels: "عند سماع الأذان",
                        Open: false, view: true,
                        poem: [
                            { Name: "لَا حَوْلَ وَلَا قُوَّةَ إِلَّا بِاللهِ" }, { Name: "اللَّهُمَّ رَبَّ هَذِهِ الدَّعْوَةِ التَّامَّةِ، وَالصَّلَاةِ الْقَائِمَةِ، آتِ مُحَمَّداً الْوَسِيلَةَ وَالْفَضِيلَةَ، وَابْعَثْهُ مَقَاماً مَحْمُوداً الَّذِي وَعَدْتَهُ، إَنَّكَ لَا تُخْلِفُ الْمِيعَادَ" }
                        ]
                    },

                    {
                        levels: 'أدعية للمغفرة من القرآن والسنة', Open: false, view: true,
                        poem: [
                            { Name: 'رَبَّنَا آمَنَّا فَاغْفِرْ لَنَا وَارْحَمْنَا وَأَنتَ خَيْرُ الرَّاحِمِينَ' }, { Name: 'رَّبَّنَا إِنَّنَا سَمِعْنَا مُنَادِيًا يُنَادِي لِلْإِيمَانِ أَنْ آمِنُوا بِرَبِّكُمْ فَآمَنَّا رَبَّنَا فَاغْفِرْ لَنَا ذُنُوبَنَا وَكَفِّرْ عَنَّا سَيِّئَاتِنَا وَتَوَفَّنَا مَعَ الْأَبْرَارِ* رَبَّنَا وَآتِنَا مَا وَعَدتَّنَا عَلَىٰ رُسُلِكَ وَلَا تُخْزِنَا يَوْمَ الْقِيَامَةِ إِنَّكَ لَا تُخْلِفُ الْمِيعَادَ' },
                            { Name: 'رَبَّنَا اغْفِرْ لَنَا وَلِإِخْوَانِنَا الَّذِينَ سَبَقُونَا بِالْإِيمَانِ وَلَا تَجْعَلْ فِي قُلُوبِنَا غِلًّا لِّلَّذِينَ آمَنُوا رَبَّنَا إِنَّكَ رَءُوفٌ رَّحِيمٌ' },
                            { Name: 'رَبَّنَا أَتْمِمْ لَنَا نُورَنَا وَاغْفِرْ لَنَا إِنَّكَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ' },
                            { Name: 'رَبَّنَا اغفِر لي وَلِوالِدَيَّ وَلِلمُؤمِنينَ يَومَ يَقومُ الحِسابُ' },
                            { Name: 'اللَّهُمَّ أنْتَ رَبِّي لا إلَهَ إلَّا أنْتَ، خَلَقْتَنِي وأنا عَبْدُكَ، وأنا علَى عَهْدِكَ ووَعْدِكَ ما اسْتَطَعْتُ، أعُوذُ بكَ مِن شَرِّ ما صَنَعْتُ، أبُوءُ لكَ بنِعْمَتِكَ عَلَيَّ، وأَبُوءُ لكَ بذَنْبِي فاغْفِرْ لِي؛ فإنَّه لا يَغْفِرُ الذُّنُوبَ إلَّا أنْتَ' },
                            { Name: 'رَبِّ اغْفِرْ لي خَطِيئَتي وجَهْلِي، وإسْرَافِي في أمْرِي كُلِّهِ، وما أنْتَ أعْلَمُ به مِنِّي، اللَّهُمَّ اغْفِرْ لي خَطَايَايَ، وعَمْدِي وجَهْلِي وهَزْلِي، وكُلُّ ذلكَ عِندِي، اللَّهُمَّ اغْفِرْ لي ما قَدَّمْتُ وما أخَّرْتُ، وما أسْرَرْتُ وما أعْلَنْتُ، أنْتَ المُقَدِّمُ وأَنْتَ المُؤَخِّرُ، وأَنْتَ علَى كُلِّ شيءٍ قَدِيرٌ' },
                            { Name: 'اللَّهُمَّ إنِّي ظَلَمْتُ نَفْسِي ظُلْماً كَثِيراً، وَلا يَغْفِرُ الذُّنُوبَ إلَّا أَنْتَ، فَاغْفِرْ لِي مَغْفِرَةً مِنْ عِنْدِكَ، وَارْحَمْنِي إنَّكَ أَنْتَ الغَفُورُ الرَّحِيمُ' },


                        ]
                    },
                    {
                        levels: 'الدعاء عند التعجب',
                        Open: false, view: true,
                        poem: [
                            { Name: 'سبحان الله' }, { Name: 'الله أكبر ' }
                        ]
                    },
                    {
                        levels: 'الدعاء بعد الوضوء',
                        Open: false, view: true,
                        poem: [
                            { Name: 'أَشْهدُ أَنْ لا إِله إِلاَّ اللَّه وحْدَه لا شَريكَ لهُ، وأَشْهدُ أَنَّ مُحمَّدًا عبْدُهُ وَرسُولُه' }, { Name: 'اللَّهُمَّ اجْعلْني من التَّوَّابِينَ واجْعلْني مِنَ المُتَطَهِّرِينَ' }
                        ]
                    },
                    {
                        levels: 'الدعاء عند الذهاب الى المسجد',
                        Open: false, view: true,
                        poem: [
                            { Name: 'للّهُـمَّ اجْعَـلْ في قَلْبـي نورا ، وَفي لِسـاني نورا، وَاجْعَـلْ في سَمْعي نورا، وَاجْعَـلْ في بَصَري نورا، وَاجْعَـلْ مِنْ خَلْفي نورا، وَمِنْ أَمامـي نورا، وَاجْعَـلْ مِنْ فَوْقـي نورا ، وَمِن تَحْتـي نورا .اللّهُـمَّ أَعْطِنـي نورا. رواه البخاري ومسلم .' }
                        ]
                    },
                    {
                        levels: 'الدعاء عند دخول المسجد',
                        Open: false, view: true,
                        poem: [
                            { Name: 'أَعوذُ باللهِ العَظيـم وَبِوَجْهِـهِ الكَرِيـم وَسُلْطـانِه القَديـم مِنَ الشّيْـطانِ الرَّجـيم' }, { Name: 'بِسْـمِ الله، وَالصَّلاةُ وَالسَّلامُ عَلى رَسولِ الله' },
                            { Name: 'اللّهُـمَّ افْتَـحْ لي أَبْوابَ رَحْمَتـِك. رواه ابو داود' },
                        ]
                    },

                    {
                        levels: 'الدعاء عند الخروج من المسجد',
                        Open: false, view: true,
                        poem: [
                            { Name: 'بِسمِ الله وَالصّلاةُ وَالسّلامُ عَلى رَسولِ الله، اللّهُـمَّ إِنّـي أَسْأَلُكَ مِـنْ فَضْـلِك، اللّهُـمَّ اعصِمْنـي مِنَ الشَّيْـطانِ الرَّجـيم.' }
                        ]
                    },
                    {
                        levels: 'دعاء الاستفتاح',
                        Open: false, view: true,
                        poem: [
                            { Name: 'سبحانك اللهم وبحمدك وتبارك اسمك وتعالى جدك ولا إله غيرك' }, { Name: 'اللهم باعد بيني وبين خطاياي كما باعدت بين المشرق والمغرب اللهم نقني من خطاياي كما ينقى الثوب الأبيض من الدنس اللهم اغسلني من خطاياي بالثلج والماء والبرد' }
                        ]
                    },
                    {
                        levels: 'الدعاء في السجود',
                        Open: false, view: true,
                        poem: [
                            { Name: 'اللَّهُمَّ اغفِرْ لي ذَنبي كُلَّهُ : دِقَّه وجِلَّهُ ، وأَوَّله وَآخِرَهُ ، وعلانيته وَسِرَّه' }, { Name: 'سُبْحَانكَ وبحمدِكَ ، لا إلهَ إلاَّ أنْتَ' }
                            , { Name: "اللَّهُمَّ إنِّي أَعُوذُ بِرضَاكَ مِنْ سَخَطِكَ ، وبمُعافاتِكَ مِنْ عُقوبتِكَ ، وَأَعُوذُ بِك مِنْكَ ، لا أُحْصِي ثَنَاءً عليكَ أَنْتَ كما أثنيتَ على نَفْسِكَ" }
                        ]
                    },
                    {
                        levels: 'دعاء مابين التشهد والتسليم',
                        Open: false, view: true,
                        poem: [
                            { Name: 'اللَّهُمَّ إنِّي أعُوذُ بِكَ مِنْ عذَابِ جهَنَّمَ ، وَمِنْ عَذَابِ القَبرِ، وَمِنْ فِتْنةِ المحْيَا والمَماتِ ، وَمِنْ شَرِّ فِتْنَةِ المَسِيح الدَّجَّالِ' }, { Name: 'اللَّهمَّ اغفِرْ لي ما قَدَّمتُ وما أَخَّرْتُ ، وما أَسْرَرْتُ ومَا أعْلَنْتُ ، وما أَسْرفْتُ ، وما أَنتَ أَعْلمُ بِهِ مِنِّي ، أنْتَ المُقَدِّمُ ، وَأنْتَ المُؤَخِّرُ ، لا إله إلاَّ أنْتَ' }
                        ]
                    },
                    {
                        levels: 'دعاء سجود التلاوة',
                        Open: false, view: true,
                        poem: [
                            { Name: 'سجد وجهي للذي خلقه وشق سمعه وبصره بحوله وقوته' }, { Name: 'اللهم اكتب لي بها عندك أجرا وضع عني بها وزرا واجعلها لي عندك ذخرا وتقبلها مني كما تقبلتها من عبدك داود' }
                        ]
                    },
                    {
                        levels: 'سيد الاستغفار',
                        Open: false, view: true,
                        poem: [
                            { Name: 'اللَّهُمَّ أَنْتَ رَبِّي ، لا إِلَه إِلاَّ أَنْتَ خَلَقْتَني وأَنَا عَبْدُكَ ، وأَنَا على عهْدِكَ ووعْدِكَ ما اسْتَطَعْتُ ، أَعُوذُ بِكَ مِنْ شَرِّ ما صنَعْتُ ، أَبوءُ لَكَ بِنِعْمتِكَ علَيَ ، وأَبُوءُ بذَنْبي فَاغْفِرْ لي ، فَإِنَّهُ لا يغْفِرُ الذُّنُوبِ إِلاَّ أَنْتَ . منْ قَالَهَا مِنَ النَّهَارِ مُوقِناً بِهَا ، فَمـاتَ مِنْ يوْمِهِ قَبْل أَنْ يُمْسِيَ ، فَهُو مِنْ أَهْلِ الجنَّةِ ، ومَنْ قَالَهَا مِنَ اللَّيْلِ وهُو مُوقِنٌ بها فَمَاتَ قَبل أَنْ يُصْبِح ، فهُو مِنْ أَهْلِ الجنَّةِ' },
                        ]
                    },
                    {
                        levels: 'الدعاء عند بداية الطعام وبعد الفراغ منه',
                        Open: false, view: true,
                        poem: [
                            { Name: 'بِسْمِ اللَّه أَوَّلَهُ وَآخِرَهُ' }, { Name: 'الحَمْدُ للَّه حمداً كَثيراً طَيِّباً مُبَارَكاً فِيه، غَيرَ مَكْفِيٍّ وَلا مُسْتَغْنًي عَنْهُ رَبَّنَا' }
                            , { Name: 'الحَمْدُ للَّهِ الذي أَطْعَمَني هذا، وَرَزَقْنِيهِ مِنْ غيْرِ حَوْلٍ مِنِّي وَلا قُوّةٍ، غُفِرَ لَهُ مَا تَقَدَّمَ مِنْ ذَنْبِهِ' },]
                    },
                    {
                        levels: 'دعاء الكرب',
                        Open: false, view: true,
                        poem: [
                            { Name: 'لا إِلَه إِلاَّ اللَّه العظِيمُ الحلِيمُ ، لا إِله إِلاَّ اللَّه رَبُّ العَرْشِ العظِيمِ ، لا إِلَهَ إِلاَّ اللَّه رَبُّ السمَواتِ ، وربُّ الأَرْض ، ورَبُّ العرشِ الكريمِ' }, { Name: 'لاإله إلا أنت سبحانك إني كنت من الظالمين ' },
                        ]
                    },
                    {
                        levels: 'الدعاء عند الهم والحزن',
                        Open: false, view: true,
                        poem: [
                            { Name: 'اللهم إني عبدك ابن عبدك ابن أمتك ناصيتي بيدك ماضِ في حكمك ، عدل في قضاؤك أسالك بكل اسم هو لك سميت به نفسك أو أنزلته في كتابك ، أو علمته أحداً من خلقك أو استأثرت به في علم الغيب عندك أن تجعل القرآن ربيع قلبي ، ونور صدري وجلاء حزني وذهاب همي' }, { Name: 'اللهم إني أعوذ بك من الهم والخزن ، والعجز والكسل والبخل والجبن ، وضلع الدين وغلبة الرجال' }
                        ]
                    },
                    {
                        levels: 'دعاء المظلوم',
                        Open: false, view: true,
                        poem: [
                            { Name: 'اللَّهُمَّ اكفنِيهمْ بمَا شِئْت' },
                        ]
                    },
                    {
                        levels: 'الدعاء عند الغضب',
                        Open: false, view: true,
                        poem: [
                            { Name: 'تعوَّذْ بِاللِّهِ مِن الشَّيَطان الرَّجِيمِ ' },
                        ]
                    },
                    {
                        levels: 'دعاء من استصعب عليه امر ما',
                        Open: false, view: true,
                        poem: [
                            { Name: 'اللهم لاسهل إلا ماجعلته سهلاً وأنت تجعل الحزن إذا شئت سهلاً' },
                        ]
                    },
                    {
                        levels: 'الدعاء لمن عرض عليك ماله',
                        Open: false, view: true,
                        poem: [
                            { Name: 'بارك الله لك في أهلك ومالك' },
                        ]
                    },
                    {
                        levels: 'دعاء من اثقلته الديون',
                        Open: false, view: true,
                        poem: [
                            { Name: 'اللَّهمَّ اكْفِني بحلالِكَ عَن حَرَامِكَ ، وَاغْنِني بِفَضلِكَ عَمَّن سِوَاكَ' },
                        ]
                    },
                    {
                        levels: 'الدعاء عند إرجاع الدين ( القرض )',
                        Open: false, view: true,
                        poem: [
                            { Name: 'بارك الله لك في أهلك ومالك إنما جزاء السلف الوفاء والحمد' },
                        ]
                    },
                    {
                        levels: 'الدعاء لمن صنع لك معروفاً',
                        Open: false, view: true,
                        poem: [
                            { Name: 'جزاك الله خيراً فقدأبلغ في الثناء' },
                        ]
                    },
                    {
                        levels: 'الدعاء عند دخول السوق وعند الخروج منه',
                        Open: false, view: true,
                        poem: [
                            { Name: 'لاإله إلا الله وحده لاشريك له ، له الملك وله الحمد ،يُحيي ويُميت ، وهو حي لايموت ، بيده الخير وهو على كل شئ قدير' },
                        ]
                    },
                    {
                        levels: 'الدعاء للمسافر',
                        Open: false, view: true,
                        poem: [
                            { Name: 'زَوَّدَكَ اللَّه التَّقْوَى وَغَفَرَ ذَنْبَكَ اللَّهمَّ اطْوِ لهُ البُعْدَ ، وَهَوِّنْ عَليهِ السَّفر' },
                        ]
                    },
                    {
                        levels: 'الدعاء عند الرجوع من السفر',
                        Open: false, view: true,
                        poem: [
                            { Name: 'لا إله إلاَّ اللَّه وَحْدَهُ لا شَرِيكَ لَهُ ، لَهُ المُلْك ولَهُ الحمْدُ ، وَهُو على كلِّ شَيءٍ قَدِيرٌ . آيِبُونَ تَائِبُونَ عابِدُونَ ساجِدُونَ لِرَبِّنَا حَامِدُونَ . صدقَ اللَّه وَعْدهُ، وَنَصر عبْده ، وَهَزَمَ الأَحزَابَ وحْدَه' },
                        ]
                    },
                    {
                        levels: 'دعاء من نزل منزلاً',
                        Open: false, view: true,
                        poem: [
                            { Name: 'أَعُوذُ بِكَلِمات اللَّهِ التَّامَّاتِ مِنْ شَرِّ مَا خَلَقَ ، لَمْ يضرَّه شَيْءٌ حتَّى يرْتَحِل مِنْ منزِلِهِ ذلكَ' }, { Name: 'يَا أَرْضُ ربِّي وَربُّكِ اللَّه ، أَعُوذُ بِاللَّهِ مِنْ شرِّكِ وشَرِّ ما فِيكِ ،وشر ماخُلقَ فيكِ ، وشَرِّ ما يدِبُّ عليكِ ، وأَعوذ باللَّهِ مِنْ شَرِّ أَسدٍ وَأَسْودٍ ، ومِنَ الحيَّةِ والعقربِ ، وَمِنْ سَاكِنِ البلَدِ، ومِنْ والِدٍ وما وَلَد' }
                        ]
                    },
                    {
                        levels: 'الدعاء عند التطير',
                        Open: false, view: true,
                        poem: [
                            { Name: 'اللَّهُمَّ لا يَأتى بالحَسَناتِ إلاَّ أنتَ ، وَلا يَدْفَعُ السَّيِّئاتِ إلاَّ أنْتَ ، وَلا حوْلَ وَلا قُوَّةَ إلاَّ بك ' },
                        ]
                    },
                    {
                        levels: 'دعاء الخوف',
                        Open: false, view: true,
                        poem: [
                            { Name: 'لاإله إلا الله' },
                        ]
                    },
                    {
                        levels: 'دعاء الخوف من عدو ونحوه',
                        Open: false, view: true,
                        poem: [
                            { Name: 'حَسْبُنَا اللَّهُ وَنِعْمَ الْوكِيلُ' }, { Name: 'اللَّهُمَّ إِنَّا نجعلُكَ في نحورِهِمْ ، ونعُوذُ بِك مِنْ شرُوِرِهمْ' }
                        ]
                    },
                    {
                        levels: 'الدعاء عند لقاء العدو',
                        Open: false, view: true,
                        poem: [
                            { Name: 'اللَّهُمَّ مُنْزِلَ الكتاب ومُجرِيَ السَّحابِ ، وهَازِمَ الأَحْزَابِ اهْزِمهُم وانْصُرنَا علَيهِم' }, { Name: 'اللَّهُمَّ أنت عضُدِي ونَصِيري ، بِك أَجُولُ ، وبِك أصولُ ، وبِكَ أُقاتِل' }
                        ]
                    },
                    {
                        levels: 'دعاء الاستسقاء',
                        Open: false, view: true,
                        poem: [
                            { Name: 'اللهم أغثنا ، اللهم أغثنا اللهم أغثنا ".( متفق عليه)" اللهم اسقنا غيثاً مغيثاً مريئاً نافعاً غير ضار ،عاجلاً غير آجل' }, { Name: 'اللهم اسق عبادك وبهائمك ، وانشر رحمتك وأحي بلدك الميت' }
                        ]
                    },
                    {
                        levels: 'الدعاء عند هيجان الريح',
                        Open: false, view: true,
                        poem: [
                            { Name: 'اللَّهُمَّ إِني أَسْأَلُكَ خَيْرَهَا ، وَخَيْرِ مَا فِيهَا ، وخَيْر ما أُرسِلَتْ بِهِ ، وَأَعُوذُ بك مِنْ شَرِّهِا ، وَشَرِّ ما فِيها ، وَشَرِّ ما أُرسِلَت بِهِ' },
                        ]
                    },
                    {
                        levels: 'الدعاء عند سماع الرعد',
                        Open: false, view: true,
                        poem: [
                            { Name: 'سبحان الذي يُسبح الرعد بحمده والملائكة من خيفته ' },
                        ]
                    },
                    {
                        levels: 'دعاء المدعو او الضيف لصاحب الطعام',
                        Open: false, view: true,
                        poem: [
                            { Name: 'أَفْطَرَ عِندكُمْ الصَّائمونَ ، وأَكَلَ طَعَامَكُمْ الأَبْرَارُ وَصَلَّتْ عَلَيْكُمُ المَلائِكَةُ' },
                        ]
                    },
                    {
                        levels: 'الدعاء عند الذبح والنحر',
                        Open: false, view: true,
                        poem: [
                            { Name: 'بسم الله والله أكبر [ اللهم منك ولك ] اللهم تقبل مني' },
                        ]
                    },
                    {
                        levels: 'دعاء الاضحية',
                        Open: false, view: true,
                        poem: [
                            { Name: 'بسم الله ، اللهم تقبل من محمد ، وآل حمد ، ومن أمة محمد' },
                        ]
                    },
                    {
                        levels: 'دعاء الاستخاره',
                        Open: false, view: true,
                        poem: [
                            { Name: 'اللَّهُم إِني أَسْتَخِيرُكَ بعِلْمِكَ ، وأستقدِرُكَ بقُدْرِتك ، وأَسْأَلُكَ مِنْ فضْلِكَ العَظِيم ، فإِنَّكَ تَقْدِرُ ولا أَقْدِرُ ، وتعْلَمُ ولا أَعْلَمُ ، وَأَنتَ علاَّمُ الغُيُوبِ . اللَّهُمَّ إِنْ كنْتَ تعْلَمُ أَنَّ هذا الأمرَ خَيْرٌ لي في دِيني وَمَعَاشي وَعَاقِبَةِ أَمْرِي' }, { Name: 'عَاجِلِ أَمْرِي وَآجِله ، فاقْدُرْهُ لي وَيَسِّرْهُ لي، ثمَّ بَارِكْ لي فِيهِ ، وَإِن كُنْتَ تعْلمُ أَنَّ هذَا الأَمْرَ شرٌّ لي في دِيني وَمَعاشي وَعَاقبةِ أَمَرِي' }
                        ]
                    },
                    {
                        levels: 'دعاء الزوج في ليلة الزفاف',
                        Open: false, view: true,
                        poem: [
                            { Name: 'اللهم إني أسألك خيرها وخير ماجبلتها عليه وأعوذ بك من شرها وشر ماجبلتها عليه ، وإذا اشترى بعيراً فليأخذ بذروة سنامه وليقل مثل ذلك ' },
                        ]
                    },
                    {
                        levels: 'ادعية الرقيه',
                        Open: false, view: true,
                        poem: [
                            { Name: 'اللَّهُمَّ ربَّ النَّاسِ ، أَذْهِب الْبَأسَ ، واشْفِ ، أَنْتَ الشَّافي لا شِفَاءَ إِلاَّ شِفَاؤُكَ ، شِفاءً لا يُغَادِرُ سقَماً ' }, { Name: 'اللَّهُمَّ رَبَّ النَّاسِ ، مُذْهِبَ البَأسِ ، اشْفِ أَنتَ الشَّافي ، لا شافي إِلاَّ أَنْتَ ، شِفاءً لا يُغادِر سَقَماً' }
                        ]
                    },
                    {
                        levels: 'دعاء من احس بوجع في جسده',
                        Open: false, view: true,
                        poem: [
                            { Name: 'ضَعْ يَدَكَ عَلى الذي يَأْلَمُ مِن جَسَدِكَ وَقلْ : بِسمِ اللَّهِ ثَلاثاً وَقُلْ سَبْعَ مَرَّاتٍ : أَعُوذُ بِعِزَّةِ اللَّهِ وَقُدْرَتِهِ مِن شَرِّ مَا أَجِدُ وَأُحاذِرُ' },
                        ]
                    },
                    {
                        levels: 'دعاء المريض',
                        Open: false, view: true,
                        poem: [
                            { Name: 'لا إِلهَ إِلاَّ اللَّهُ لَهُ المُلْكُ وَلَهُ الحَمْدُ ،' },
                        ]
                    },
                    {
                        levels: 'دعاء عيادة المريض',
                        Open: false, view: true,
                        poem: [
                            { Name: 'اللَّهُمَّ اشْفِ سعْداً ، اللَّهُمَّ اشْفِ سَعْداً ، اللَّهُمْ اشْفِ سَعداً' }, { Name: 'مَنْ عَادَ مَرِيضاً لَمْ يَحْضُرْهُ أَجَلُهُ ، فقالَ عِنْدَهُ سَبْعَ مَرَّات : أَسْأَلُ اللَّه الْعَظِيمَ رَبَّ الْعَرْشِ الْعَظِيمِ أَنْ يَشفِيَك : إِلاَّ عَافَاهُ اللَّه مِنْ ذلكَ المَرَضِ' }
                        ]
                    },
                    {
                        levels: 'الدعاء عند رؤية مبتلى',
                        Open: false, view: true,
                        poem: [
                            { Name: 'الحمد لله الذي عافاني مما ابتلاك به وفضّلني على كثير ممن خلق تفضيلاً' },
                        ]
                    },
                    {
                        levels: 'دعاء من ايس من حياته',
                        Open: false, view: true,
                        poem: [
                            { Name: 'اللَّهُمَّ أَحْيني ما كَانَت الْحياةُ خَيراً لِي وتوفَّني إِذَا كَانَتِ الْوفاَةُ خَيْراً لِي' },
                        ]
                    },
                    {
                        levels: 'دعاء من يصارع سكرات الموت',
                        Open: false, view: true,
                        poem: [
                            { Name: 'اللَّهُمَّ أَعِنِّي على غمرَاتِ الموْتِ وَسَكَراتِ المَوْتِ' }, { Name: 'اللَّهُمَّ اغفِرْ لي وَارْحمْني ، وَأَلحِقني بالرَّفِيقِ الأَعْلَى' }
                        ]
                    },
                    {
                        levels: 'الدعاء عند تغميض الميت',
                        Open: false, view: true,
                        poem: [
                            { Name: 'اللَّهُمَّ اغْفِر لأبي سَلَمَة ، وَارْفَعْ درَجَتهُ في المَهْدِيِّينَ ، وَاخْلُفْهُ في عَقِبِهِ في الْغَابِرِين، واغْفِرْ لَنَا ولَه يَاربَّ الْعَالمِينَ ، وَافْسحْ لَهُ في قَبْرِهِ ، وَنَوِّرْ لَهُ فيه' },
                        ]
                    },
                    {
                        levels: 'دعاء التعزية',
                        Open: false, view: true,
                        poem: [
                            { Name: 'إن للَّه مَا أَخَذَ ، ولهُ مَا أعْطَى ، وكُلُّ شَيْءٍ عِنْدَهُ بأجَلٍ مُسمَّى ، فلتصْبِر ولتحْتسبْ' },
                        ]
                    },
                ],
            }
        }
    }

    Array(index) {
        let new_in = this.state.Arr
        if (new_in[index].Open == true) {
            new_in[index].Open = false
        } else {
            for (var i = 0; i < new_in.length; i++) {
                new_in[i].Open = false
            }
            new_in[index].Open = true

        }


        this.setState({ Arr: new_in })
    }


    makesearch(searchText) {
        let list = this.state.Arr
        for (let i = 0; i < list.length; i++) {
            if (((list[i].levels).toUpperCase()).includes(searchText.toUpperCase())) {
                list[i].view = true
            }
            else {
                list[i].view = false
            }
        }
        this.setState({ Arr: list })
    }



    render() {
        return (
            <>
                <StatusBar backgroundColor="#0c0c0c" />

                <ImageBackground source={require('../img/20.jpg')}
                    style={{
                        height: height,
                        width: width,
                        justifyContent: "flex-start",
                        alignItems: "flex-start",
                    }}
                    resizeMode={'cover'}>



                    <View style={{
                        flex: 1,
                    }}>

                        {/* <View style={{
                            width: width,
                            justifyContent: "center",
                            alignItems: "center"
                        }}>

                            <Text style={{
                                fontSize: 20,
                                padding: 10,
                                color: "#fff"
                            }}>الادعيه</Text>



                        </View> */}

                        <View
                            style={{
                                justifyContent: "center",
                                alignItems: "center",
                                alignSelf: "center",
                                padding: 10,
                                paddingHorizontal: 50,
                                borderRadius: 20,
                                backgroundColor: "#bbbbbb",
                                marginTop: 5
                            }}>

                            <Text style={{
                                fontSize: 20,
                                color: COLORS.background
                            }}>الادعيه</Text>

                        </View>

                        <View style={{
                            // backgroundColor: '#008bff',
                            flexDirection: "row",
                            alignItems: "center",
                            alignSelf: "center",
                            justifyContent: "center"
                        }}>
                            <View style={{
                                width: "100%",
                                flexDirection: "row",
                                justifyContent: 'space-evenly',
                                alignItems: "center",
                                // borderBottomRadius: 1,
                                borderRadius: 50,
                                borderColor: COLORS.white,
                                borderBottomWidth: 3,
                                //   backgroundColor:"#f0f"

                            }}>
                                <TouchableOpacity>
                                    <FontAwesome5 name='search' size={20} color={COLORS.gray} style={{padding: 10}} />
                                </TouchableOpacity>
                                <TextInput style={{
                                    color: '#fff', 
                                    padding: 10, 
                                    fontSize: 20,
                                    width: "80%"
                                }}
                                    placeholder={'بحث'}
                                    placeholderTextColor={COLORS.gray}
                                    onChangeText={(value) => {
                                        this.makesearch(value)
                                        this.setState({ search: value })
                                    }}
                                    value={this.state.search}>

                                </TextInput>
                            </View>


                        </View>

                        <ScrollView>


                            {this.state.Arr.map((item, index) => (


                                <Animatable.View
                                    animation={"fadeInRightBig"}>
                                    {item.view ? (

                                        <TouchableOpacity
                                            onPress={() => { this.Array(index) }}
                                            style={{
                                                width: width,
                                                flexDirection: "row",
                                                justifyContent: "space-between",
                                                alignItems: "center",
                                                padding: 10,
                                            }}>

                                            <Text style={{
                                                fontSize: 20,
                                                color: "#ddd"
                                            }}>{item.levels}</Text>
                                            <FontAwesome5 name={item.Open ? "chevron-down" : "chevron-left"}
                                                size={30}
                                                color={"#bbbbbb"} />

                                        </TouchableOpacity>
                                    ) : (null)}

                                    {item.Open ?

                                        item.poem.map((items, index) => (

                                            <View style={{
                                                padding: 20,
                                                backgroundColor: COLORS.Yellow,
                                                borderRadius: 10,
                                                marginTop: 5,
                                                marginHorizontal: 10,
                                                flexDirection: "row",
                                                justifyContent: 'center',
                                            }}>
                                                <Text style={{
                                                    fontSize: 15,
                                                    color: "#fff",

                                                }}> . {index + 1}</Text>

                                                <Text style={{
                                                    fontSize: 15,
                                                    color: "#fff",
                                                }}>{items.Name}</Text>

                                            </View>

                                        ))
                                        : null}




                                </Animatable.View>
                            ))}<View style={{ height: 60, width: width }}></View>

                        </ScrollView>
                    </View>
                </ImageBackground>
            </>
        )
    }
}
