import * as React from 'react';
import {
  Text,
  StyleSheet,
  View,
  Button,
  TouchableOpacity,
  Image,
  ScrollView,
  ImageBackground,
  StatusBar,
  TextInput,
  Dimensions,
  Modal,
  AsyncStorage
} from 'react-native';
import FontAwesome5 from 'react-native-vector-icons/FontAwesome5';
import AntDesign from 'react-native-vector-icons/AntDesign';
import * as Animatable from 'react-native-animatable';
import { COLORS } from '../constants';

const { width, height } = Dimensions.get('window');


export default class Hades extends React.Component {


  constructor() {
    super(); {
      this.state = {
        Arr2: [

          {
            Name: 'قال رسول الله صلى الله عليه وآله وصحبه وسلم: (أبْغَضُ الرجال إلى الله الألَدُّ الخَصِم). رواه البخاري ومسلم.',
            view: true
          },
          {
            Name: 'قال رسول الله صلى الله عليه وآله وصحبه وسلم: (اتق الله حيثما كنت، وأتبع السيئة الحسنة تمحها، وخالق الناس بخلق حسن). حديث حسن رواه الترمذي.',
            view: true
          },
          {
            Name: 'قال رسول الله صلى الله عليه وآله وصحبه وسلم: (أحب البلاد إلى الله مساجدها، وأبغض البلاد إلى الله أسواقها). رواه مسلم.',
            view: true
          },
          {
            Name: 'قال رسول الله صلى الله عليه وآله وصحبه وسلم: (أحبوا الله لما يغذوكم به من نعمه، وأحبوني لحب الله، وأحبوا أهل بيتي لحبي). رواه الترمذي.',
            view: true
          },
          {
            Name: 'قال رسول الله صلى الله عليه وآله وصحبه وسلم: (بشر المشّائينَ في الظُّلَم إلى المساجد بالنور التام يوم القيامة). حديث صحيح رواه أبو داود.',
            view: true
          },
          {
            Name: 'قال رسول الله صلى الله عليه وآله وصحبه وسلم: (بروا آباءكم تَبرَّكُم أبناؤكم، وعفُّوا تَعفَّ نساؤكم). حديث حسن رواه الطبراني.',
            view: true
          },
          {
            Name: 'قال رسول الله صلى الله عليه وآله وصحبه وسلم: (البخيل من ذكرتُ عنده فلم يصلِّ عليَّ). حديث صحيح رواه الإمام أحمد.',
            view: true
          },
          {
            Name: 'قال رسول الله صلى الله عليه وآله وصحبه وسلم: (بين كلّ أذانين صلاةٌ لمن شاء). رواه البخاري ومسلم.',
            view: true
          },
          {
            Name: 'قال رسول الله صلى الله عليه وآله وصحبه وسلم: (التاجر الأمين الصدوق المسلم مع الشهداء يوم القيامة). حديث صحيح رواه الحاكم.',
            view: true
          },
          {
            Name: 'قال رسول الله صلى الله عليه وآله وصحبه وسلم: (ثلاثة لا ترفع صلاتهم فوق رؤوسهم شبراً: رجل أمَّ قوماً و هم له كارهون، و امرأة باتت وزوجها عليها ساخط، وأخوان متصارمان). حديث حسن رواه ابن ماجه.',
            view: true
          },
          {
            Name: 'قال رسول الله صلى الله عليه وآله وصحبه وسلم: (جالسوا الكبراء، وسائلوا العلماء، وخالطوا الحكماء). حديث صحيح رواه الطبراني.',
            view: true
          },
          {
            Name: 'قال رسول الله صلى الله عليه وآله وصحبه وسلم: (جاهدوا المشركين بأموالكم وأنفسكم وألسنتكم). حديث صحيح رواه أحمد.',
            view: true
          },
          {
            Name: 'قال رسول الله صلى الله عليه وآله وصحبه وسلم: (جددوا إيمانكم أكثروا من قول: لا إله إلا الله). حديث صحيح رواه أحمد.',
            view: true
          },
          {
            Name: 'قال رسول الله صلى الله عليه وآله وصحبه وسلم: (حب الدنيا رأس كلّ خطيئة). رواه البيهقي.',
            view: true
          },
          {
            Name: 'قال رسول الله صلى الله عليه وآله وصحبه وسلم: (حُفَّت الجنة بالمكاره وحُفَّت النار بالشهوات). رواه مسلم.',
            view: true
          },
          {
            Name: 'قال رسول الله صلى الله عليه وآله وصحبه وسلم: (خمس من حق المسلم على المسلم: رد التحية، وإجابة الدعوة، وشهود الجنازة، وعيادة المريض، وتشميت العاطس إذا حمد الله). حديث صحيح رواه ابن ماجه.',
            view: true
          },
          {
            Name: 'قال رسول الله صلى الله عليه وآله وصحبه وسلم: (خياركم أحاسِـنُكم أخلاقاً). رواه البخاري ومسلم.',
            view: true
          },
          {
            Name: 'قال رسول الله صلى الله عليه وآله وصحبه وسلم: (خيركم من تعلم القرآنَ وعلَّمه). رواه البخاري.',
            view: true
          },
          {
            Name: 'قال رسول الله صلى الله عليه وآله وصحبه وسلم: (الخَلْق كلُّهم عيال الله فأحبُّهم إلى الله أنفُعهم لعياله). رواه أبو يعلي.',
            view: true
          },
          {
            Name: 'قال رسول الله صلى الله عليه وآله وصحبه وسلم: (دع ما يريبك إلى ما لا يريبك). حديث صحيح رواه النَّسائي.',
            view: true
          },
          {
            Name: 'قال رسول الله صلى الله عليه وآله وصحبه وسلم: (الدعاء بين الأذان والإقامة مستجاب فادعوا). حديث صحيح رواه أبو يعلي.',
            view: true
          },
          {
            Name: 'قال رسول الله صلى الله عليه وآله وصحبه وسلم: (ذاق طعمَ الإيمان من رضي بالله رباً، وبالإسلام ديناً، وبمحمد رسولاً). رواه مسلم',
            view: true
          },
          {
            Name: 'قال رسول الله صلى الله عليه وآله وصحبه وسلم: (رُبَّ أشعثَ مدفوع بالأبواب؛ لو أقسم على الله لأبرَّه). رواه مسلم.',
            view: true
          },
          {
            Name: 'قال رسول الله صلى الله عليه وآله وصحبه وسلم: (ركعتا الفجر خير من الدنيا وما فيها). رواه الترمذي.',
            view: true
          },
          {
            Name: 'قال رسول الله صلى الله عليه وآله وصحبه وسلم: (ركعتان بسواك خير من سبعين ركعة بغير سواك). رواه الدارَقطني.',
            view: true
          },
          {
            Name: 'قال رسول الله صلى الله عليه وآله وصحبه وسلم: (الراحمون يرحمهم الرحمن تبارك وتعالى، ارحموا من في الأرض يرحمكم من في السماء). حديث صحيح رواه أحمد.',
            view: true
          },
          {
            Name: 'قال رسول الله صلى الله عليه وآله وصحبه وسلم: (زوروا القبور فإنها تذكركُم الآخرةَ). رواه ابن ماجه.',
            view: true
          },
          {
            Name: 'قال رسول الله صلى الله عليه وآله وصحبه وسلم: (زينوا القرآن بأصواتكم). رواه مسلم.',
            view: true
          },
          {
            Name: 'قال رسول الله صلى الله عليه وآله وصحبه وسلم: (سورة تبارك هي المانعة من عذاب القبر). حديث حسن رواه ابن مردويه.',
            view: true
          },
          {
            Name: 'قال رسول الله صلى الله عليه وآله وصحبه وسلم: (شفاعتي لأهل الكبائر من أمتي). حديث حسن رواه أحمد.',
            view: true
          },
          {
            Name: 'قال رسول الله صلى الله عليه وآله وصحبه وسلم: (صدقة السر تطفئ غضب الرب). حديث حسن رواه الطبراني.',
            view: true
          },
          {
            Name: 'قال رسول الله صلى الله عليه وآله وصحبه وسلم: (صلاة الجماعة تفضل صلاة الفذِّ بسبع وعشرين درجة). رواه البخاري ومسلم.',
            view: true
          },
          {
            Name: 'قال رسول الله صلى الله عليه وآله وصحبه وسلم: (طعام الاثنين كافي الثلاثة، و طعام الثلاثة كافي الأربعة). رواه البخاري ومسلم.',
            view: true
          },
          {
            Name: 'قال رسول الله صلى الله عليه وآله وصحبه وسلم: (إنما الأعمال بالنيات، وإنما لكلِّ امرئ ما نوى، فمن كانت هجرته إلى الله ورسوله فهجرته إلى الله ورسوله، ومن كانت هجرته لدنيا يصيبها أو امرأة ينكحها فهجرته إلى ما هاجر إليه). رواه البخاري ومسلم.'
            , view: true
          },
          {Name:'ال رسول الله صلى الله عليه وآله وصحبه وسلم: (أبْغَضُ الرجال إلى الله الألَدُّ الخَصِم). رواه البخاري ومسلم.',
        view:true},
        {Name:'قال رسول الله صلى الله عليه وآله وصحبه وسلم: (بروا آباءكم تَبرَّكُم أبناؤكم، وعفُّوا تَعفَّ نساؤكم). حديث حسن رواه الطبراني.',
        view:true},
        {Name:'قال رسول الله صلى الله عليه وآله وصحبه وسلم: (البخيل من ذكرتُ عنده فلم يصلِّ عليَّ). حديث صحيح رواه الإمام أحمد.',
        view:true},
         {Name:'قال رسول الله صلى الله عليه وآله وصحبه وسلم: (رُبَّ أشعثَ مدفوع بالأبواب؛ لو أقسم على الله لأبرَّه). رواه مسلم.',
        view:true},
         {Name:'قال رسول الله صلى الله عليه وآله وصحبه وسلم: (طلب الحلال واجب على كلِّ مسلم). حديث حسن رواه الديلمي.',
        view:true},
        {Name:'قال رسول الله صلى الله عليه وآله وصحبه وسلم: (غدوة في سبيل الله أو روحة خير من الدنيا وما فيها). رواه البخاري ومسلم.',
        view:true},
        {Name:'قال رسول الله صلى الله عليه وآله وصحبه وسلم: (غنيمة مجالس الذكر الجنة). رواه أحمد.',
        view:true},
        {Name:'قال رسول الله صلى الله عليه وآله وصحبه وسلم: (فاطمةُ بَضعةٌ مني يقبضني ما يقبضها، ويبسطني ما يبسطها، وإن الأنساب تنقطع يوم القيامة غير نسبي وسببي وصهري). رواه الحاكم.',
        view:true},
        {Name:'قال رسول الله صلى الله عليه وآله وصحبه وسلم: (فرقُ ما بيننا وبين المشركين العمائم على القلانس). رواه أبو داود .',
        view:true},
        {Name:'قال رسول الله صلى الله عليه وآله وصحبه وسلم: (قال الله تعالى: أنا عند ظن عبدي بي فليظنَّ بي ما شاء). حديث صحيح رواه الحاكم.',
        view:true},
        {Name:'قال رسول الله صلى الله عليه وآله وصحبه وسلم: (قل هو الله أحد تعدلُ ثلث القرآن). رواه البخاري.',
        view:true},
        {Name:' قال رسول الله صلى الله عليه وآله وصحبه وسلم: (كفى بالمرء كذباً أن يحدث بكلِّ ما سمع). رواه مسلم.',
        view:true},
        {Name:'قال رسول الله صلى الله عليه وآله وصحبه وسلم: (كلمتان خفيفتان على اللسان، ثقيلتان في الميزان، حبيبتان إلى الرحمن؛ سبحان الله وبحمده سبحان الله العظيم). رواه البخاري ومسلم',
        view:true},
        {Name:' قال رسول الله صلى الله عليه وآله وصحبه وسلم: (لكلِّ شيء صفوة وصفوة الصلاة التكبيرة الأولى). حديث حسن رواه البيهقي.',
        view:true},
        {Name:'قال رسول الله صلى الله عليه وآله وصحبه وسلم: (لو كانت الدنيا تعدل عند الله جناح بعوضة ما سقى كافراً منها شربة ماء). حديث صحيح رواه الترمذي.',
        view:true},
        {Name:'قال رسول الله صلى الله عليه وآله وصحبه وسلم: (من سلك طريقاً يلتمس فيه علماً سهل الله له طريقاً إلى الجنة). حديث حسن رواه الترمذي.',
        view:true},
        {Name:'قال رسول الله صلى الله عليه وآله وصحبه وسلم: (من صلى العشاء في جماعة فكأنما قام نصف الليل، ومن صلى الصبح في جماعة فكأنما صلى الليل كله). رواه مسلم.',
        view:true},
        {Name:'ال رسول الله صلى الله عليه وآله وصحبه وسلم: (المرء مع من أحب). رواه البخاري.',
        view:true},
        {Name:'قال رسول الله صلى الله عليه وآله وصحبه وسلم: (نعم الإدام الخل). رواه مسلم.',
        view:true},
        {Name:'قال رسول الله صلى الله عليه وآله وصحبه وسلم: (هل تُرزقون وتنصرون إلاّ بضعفائكم). رواه البخاري.',
        view:true},
        {Name:'قال رسول الله صلى الله عليه وآله وصحبه وسلم: (هلك المتنطعون). رواه مسلم.',
        view:true},
        {Name:'قال رسول الله صلى الله عليه وآله وصحبه وسلم: (والذي نفسي بيده لا يؤمن عبد حتى يحب لأخيه ما يحب لنفسه من الخير). رواه النَّسائي.',
        view:true},
        {Name:' قال رسول الله صلى الله عليه وآله وصحبه وسلم: (لا آكُلُ وأنا مُتَّكِئٌ). رواه البخاري.',
        view:true},
        {Name:'قال رسول الله صلى الله عليه وآله وصحبه وسلم: (لا تُصاحبْ إلأّ مؤمناً، ولا يأكلْ طعامك إلا تقيٌّ). حديث صحيح رواه أحمد.',
        view:true},
        {Name:'قال رسول الله صلى الله عليه وآله وصحبه وسلم: (لا حول ولا قوة إلا بالله دواءٌ من تسعة وتسعين داء أيسرُها الهمُّ). حديث حسن رواه ابن أبي الدنيا.',
        view:true},
        {Name:'قال رسول الله صلى الله عليه وآله وصحبه وسلم: (يسروا ولا تعسروا وبشروا ولا تنفروا). رواه البخاري ومسلم.',
        view:true},
        {Name:'قال رسول الله صلى الله عليه وآله وصحبه وسلم: (يَؤُمُّ القوم أقرؤهم للقرآن). حديث صحيح رواه أحمد.',
        view:true},
        {Name:'قال رسول الله صلى الله عليه وآله وصحبه وسلم: (يغفر للشهيد كلُّ ذنب إلا الدين). رواه مسلم.',
        view:true},
        {Name:'قال رسول الله صلى الله عليه وآله وصحبه وسلم: (يقول الله تعالى: أنا عند ظن عبدي بي، وأنا معه إذا ذكرني، فإن ذكرني في نفسه ذكرته في نفسي، وإن ذكرني في ملاء ذكرته في ملاء خير منهم، وإن تقرب إليّ بشبر تقربت إليه ذراعاً، وإن تقرب إليَّ ذراعاً تقربت إليه باعاً، وإن أتاني يمشي أتيته هرولة). رواه البخاري ومسلم',
        view:true},
        {Name:'عن عمر بن الخطاب - رضي الله عنه - قال : سمعت رسول الله (صلي الله عليه وسلم) يقول " انما الاعمال بالنيات وانما لكل امرئ ما نوي فمن كانت هجرته الي الله ورسوله فهجرته الي الله ورسوله ومن كانت هجرته لدنيا يصيبها او امراة ينكحها فهجرته الي ما هاجر اليه "',
        view:true},
        {Name:'عن النعمان بن بشير – رضي الله عنهما عن النبي - صلي الله عليه وسلم – قال " مثل القائم في حدود الله والواقع فيها كمثل قوم استهموا علي سفينه فصار بعضهم اعلاها وبعضهم اسفلها وكان الذين في اسفلها اذا استقوا من الماء مروا علي من فوقهم فقالوا لو انا خرقنا في نصيبنا خرقا ولم نؤذ من فوقنا فان تركوهم وما ارادوا هلكوا جميعا وان اخذوا علي ايديهم نجوا ونجوا جميعا "',
        view:true},
        {Name:'عن ابي سعيد الخدري - رضي الله عنه - عن النبي (صلي الله عليه وسلم ) قال " اياكم والجلوس في الطرقات قالوا يا رسول مالنا من مجالسنا بد نتحدث فيها . فقال رسول الله (صلي الله عليه وسلم) : فإذا أبيتم إلا المجلس فأعطوا الطريق حقه قالوا : وما حق الطريق يا رسول الله ؟ قال : غض البصر وكف الأذى ورد السلام والأمر بالمعروف والنهي عن المنكر "',
        view:true},
        {Name:'عن أبي أمامه رضي الله عنه – قال : سمعت رسول الله ( صلي الله عليه وسلم ) يقول " اقرءوا القرآن فإنه يأتي يوم القيامة شفيعا لأصحابه "',
        view:true},
        {Name:'عن جابر – رضي الله عنه – قال : قال رسول الله ( صلي الله عليه وسلم ) " مثل الصلوات الخمس كمثل نهر جار غمر علي باب أحدكم يغتسل منه كل يوم خمس مرات "',
        view:true},
        {Name:'عن عبد الله بن عمرو بن العاص – رضي الله عنهما – ان النبي (صلي الله عليه وسلم) قال " اربع من كن فيه كان منافقا خالصا ومن كانت فيه خصلة منهن كانت خصلة من النفاق حتي يدعها . اذا اؤتمن خان واذا حدث كذب واذا عاهد غدر واذا خاصم فجر "',
        view:true},
        {Name:'عن ابي مالك الحارث بن عاصم الاشعري – رضي الله عنه – قال : قال رسول الله ( صلي الله عليه وسلم ) " الطهور شطر الايمان والحمد لله تملأ الميزان وسبحان الله والحمد لله تملآن او تملآ ما بين السماوات والارض والصلا نور والصدقة برهان والصبر ضياء والقرآن حجة لك او عليك كل الناس يغدو فبائع نفسه فمعتقها او موبقها "',
        view:true},
        {Name:'عن أبي سعيد رضي الله عنه أن النبي صلى الله عليه وسلم قال: أيها الناس: إن ربكم واحد، وإن أباكم واحد، ألا لا فضل لعربي على أعجمي ولا لعجمي على عربي ولا لأحمر على أسود وأود على أحسمر إلا بالتقوى. روه أحمد.',
        view:true},
        {Name:'قَالَ النَّبِيُّ ، : "كَلِمَتَانِ خَفِيفَتَانِ عَلَى اللِّسَانِ، ثَقِيلَتَانِ فِي الْمِيزَانِ، حَبِيبَتَانِ إِلَى الرَّحْمنِ: سُبْحَانَ اللهِ الْعَظِيمِ، سبْحَانَ اللهِ وَبِحَمْدِهِ" متفق عليه من حديث أَبِي هُرَيْرَةَ رضي الله عنه',
        view:true},
        {Name:'قال رَسُولُ اللهِ : "مَنْ قَالَ لاَ إِلهَ إِلاَّ اللهُ وَحْدَهُ لاَ شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ فِي كُلِّ يَوْمٍ، مَائَةَ مَرَّةٍ كَانَتْ لَهُ عَدْلَ عَشْرِ رِقَابٍ، وَكُتِبَتْ لَهُ مَائَةُ حَسَنَةٍ، وَمُحِيَتْ عَنْهُ مَائَةُ سَيِّئَةٍ، وَكَانَتْ لَهُ حِرْزًا مِنَ الشَّيْطَانِ، يَوْمَهُ ذلِكَ، حَتَّى يُمْسِي وَلَمْ يَأْتِ أَحَدٌ بِأَفْضَلَ مِمَّا جَاءَ بِهِ، إِلاَّ أَحَدٌ عَمِلَ أَكْثَرَ مِنْ ذَلِكَ" متفق عليه من حديث أَبِي هُرَيْرَةَ رضي الله عنه',
        view:true},
        {Name:'قال النبيُّ : "مَنْ أَحَبَّ لِقَاءَ اللهِ، أَحَبَّ اللهُ لِقَاءَهُ وَمَنْ كَرِهَ لِقَاءَ اللهِ، كَرِهَ اللهُ لِقَاءَهُ" متفق عليه من حديث عُبَادَةَ بْنِ الصَّامِتِ و حديث أَبِي مُوسى الأشعري رضي الله عنهما',
        view:true},
        {Name:'قال رَسُولُ اللهِ : "لَوْلاَ أَنْ أَشُقَّ عَلَى أُمَّتِي أَوْ عَلَى النَّاسِ لأَمَرْتُهُمْ بِالسِّوَاكِ مَعَ كُلِّ صَلاَةٍ" متفق عليه من حديث أَبِي هُرَيْرَةَ رضي الله عنه',
        view:true},
        {Name:'عَنْ أَبي الدَّرْداءِ، رضي الله عنه، قَال: سمِعْتُ رَسُول اللَّهِ ﷺ، يقولُ: منْ سَلَكَ طَريقًا يَبْتَغِي فِيهِ علْمًا سهَّل اللَّه لَه طَريقًا إِلَى الجنةِ، وَإنَّ الملائِكَةَ لَتَضَعُ أجْنِحَتَهَا لِطالب الْعِلْمِ رِضًا بِما يَصْنَعُ، وَإنَّ الْعالِم لَيَسْتَغْفِرُ لَهُ منْ في السَّمَواتِ ومنْ فِي الأرْضِ حتَّى الحِيتانُ في الماءِ، وفَضْلُ الْعَالِم عَلَى الْعابِدِ كَفَضْلِ الْقَمر عَلى سَائِرِ الْكَوَاكِبِ، وإنَّ الْعُلَماءَ وَرَثَةُ الأنْبِياءِ وإنَّ الأنْبِياءَ لَمْ يُورِّثُوا دِينَارًا وَلا دِرْهَمًا وإنَّما ورَّثُوا الْعِلْمَ، فَمنْ أَخَذَهُ أَخَذَ بِحظٍّ وَافِرٍ. رواهُ أَبُو داود والترمذيُّ.',
        view:true},
        {Name:'عنِ ابن مسْعُودٍ،رضي الله عنه، قالَ: سمِعْتُ رَسُولَ اللَّه ﷺ يَقُولُ: نَضَّرَ اللَّه امْرءًا سمِع مِنا شَيْئًا، فبَلَّغَهُ كَمَا سَمعَهُ فَرُبَّ مُبَلَّغٍ أوْعى مِنْ سَامِع. رواهُ الترمذيُّ وقال: حديثٌ حَسنٌ صَحيحٌ.',
        view:true},
        {Name:'عن أَبي هُريرةَ، رضي الله عنه، قَالَ: قَالَ رسُولُ اللَّه ﷺ: منْ سُئِل عنْ عِلمٍ فَكَتَمَهُ، أُلجِم يَومَ القِيامةِ بِلِجامٍ مِنْ نَارٍ. رواهُ أَبو داود والترمذي، وَقالَ: حديثٌ حسنٌ.',
        view:true},
        {Name:'عنه قَالَ: قَالَ رسولُ اللَّه ﷺ: منْ تَعلَّمَ عِلمًا مِما يُبتَغَى بِهِ وَجْهُ اللَّهِ عز وجل لا يَتَعلَّمُهُ إِلاَّ ليصِيبَ بِهِ عَرَضًا مِنَ الدُّنْيا لَمْ يجِدْ عَرْفَ الجنَّةِ يوْم القِيامةِ يَعْنِي: رِيحَهَا، رواه أَبُو داود بإسناد صحيح.',
        view:true},
        {Name:'عنْ عبدِاللَّه بن عمرو بن العاص رضي اللَّه عَنهُما قَالَ: سمِعتُ رسولَ اللَّه ﷺ يقول: إنَّ اللَّه لاَ يقْبِض العِلْم انْتِزَاعًا ينْتزِعُهُ مِنَ النَّاسِ، ولكِنْ يقْبِضُ العِلْمَ بِقَبْضِ العُلَماءِ حتَّى إِذَا لمْ يُبْقِ عَالِمًا، اتَّخَذَ النَّاسُ رُؤوسًا جُهَّالًا فَسئِلُوا، فأفْتَوْا بغَيْرِ علمٍ، فَضَلُّوا وأَضَلُّوا متفقٌ عَلَيْهِ.',
        view:true},
        {Name:' قال رسول الله صلى الله عليه وآله وصحبه وسلم: (ثلاثة لا ترفع صلاتهم فوق رؤوسهم شبراً: رجل أمَّ قوماً و هم له كارهون، و امرأة باتت وزوجها عليها ساخط، وأخوان متصارمان). حديث حسن رواه ابن ماجه.',
        view:true},
         {Name:'قال رسول الله صلى الله عليه وآله وصحبه وسلم: (حُفَّت الجنة بالمكاره وحُفَّت النار بالشهوات). رواه مسلم.',
        view:true},
        {Name:'قال رسول الله صلى الله عليه وآله وصحبه وسلم: (خيركم من تعلم القرآنَ وعلَّمه). رواه البخاري.',
        view:true},
        {Name:'قال رسول الله صلى الله عليه وآله وصحبه وسلم: (الخَلْق كلُّهم عيال الله فأحبُّهم إلى الله أنفُعهم لعياله). رواه أبو يعلي.',
        view:true},
        {Name:'قال رسول الله صلى الله عليه وآله وصحبه وسلم: (بشر المشّائينَ في الظُّلَم إلى المساجد بالنور التام يوم القيامة). حديث صحيح رواه أبو داود.',
        view:true},
        {Name:'عن عبد الله بن عمر -رضي الله عنهما- أن رسول الله -صلى الله عليه وسلم- كان إذا استَوَى على بَعِيره خارجًا إلى سَفَر، كَبَّرَ ثلاثا، ثم قال: «سبحان الذي سخَّر لنا هذا وما كُنَّا له مُقْرِنِينَ وإنَّا إلى ربِّنا لـمُنْقَلِبُون، اللهم إنَّا نَسْأَلُك في سفرنا هذا البِرَّ والتَّقْوَى، ومن العمل ما تَرْضَى، اللهم هَوِّنْ علينا سفرنا هذا واطْوِ عنا بُعْدَه، اللهم أنت الصاحب في السفر، والخليفة في الأهل، اللهم إني أعوذ بك مِن وَعْثَاء السفر، وكآبة الـمَنْظر، وسوء الـمُنْقَلَب في المال والأهل والولد». وإذا رجع قالهن. وزاد فيهن «آيبون تائبون عابدون لِربنا حامدون». وفي رواية: كان النبي -صلى الله عليه وسلم- إذا قَفَل من الحج أو العمرة، كلما أَوْفَى على ثَنِيَّة أو فَدْفَدٍ كَبَّرَ ثلاثا، ثم قال: «لا إله إلا الله وحده لا شريك له، له الملك وله الحمد، وهو على كل شيء قدير، آيِبون، تائبون، عابدون، ساجدون، لربنا حامدون، صدَق الله وَعْدَه، ونصَر عَبْدَه، وهزَم الأحزابَ وحده». وفي لفظ: إذا قَفَل من الجيوش أو السَّرايا أو الحج أو العمرة.',
        view:true},
        {Name:'عن أبي سعيد وأبي هريرة -رضي الله عنهما- مرفوعاً: «إذا خرج ثلاثة في سفر فَلْيُؤَمِّرُوا أحدهم».',
        view:true},
        {Name:'كَانَ ابنُ عمرَ -رضِيَ الله عنهما- يَقُول لِلرَّجُل إِذَا أَرَادَ سَفَرًا: ادْنُ مِنِّي حَتَّى أُوَّدِعَكَ كَمَا كَان رسولُ الله -صلَّى الله عليه وسلَّم- يُوَدِّعُنَا، فَيقُول: «أَسْتَوْدِعُ الله دِينَكَ، وَأَمَانَتَكَ، وَخَوَاتِيمَ عَمَلِكَ». وعن عبد الله بن يزيد الخطمي رضي الله عنه- قال: كَانَ رسُول الله -صلَّى الله عليه وسلَّم- إِذَا أَرَادَ أَنْ يُوَدِّعَ الجَيشَ، قال: «أَسْتَودِعُ الله دِينَكُم، وَأَمَانَتَكُم، وخَوَاتِيمَ أَعْمَالِكُم».',
        view:true},
        {Name:'عن أبي هريرة -رضي الله عنه- مرفوعاً: «السفر قطعة من العذاب، يمنع أحدكم طعامه وشرابه ونومه، فإذا قضى أحدكم نَهْمَتَهُ من سفره، فليُعَجِّلْ إلى أهله».',
        view:true},
        {Name:'عن أبي هريرة -رضي الله عنه- مرفوعاً: «ثلاثُ دَعواتٍ مُستجابات لا شك فِيهن: دعوةُ المظلومِ، ودعوةُ المسافرِ، ودعوةُ الوالدِ على وَلدِه».',
        view:true},
        {Name:'عن عبد الله بن سَرْجِس -رضي الله عنه- قال: كان رسول الله -صلى الله عليه وسلم- إذا سافر يَتَعَوَّذ مِن وَعْثاء السَّفَر، وكآبة الـمُنْقَلَب، والحَوْر بعد الكَوْن، ودعوة المظلوم، وسُوء الـمَنْظَر في الأهل والمال.',
        view:true},
        {Name:'عن أبي سعيد الخدري أن رسول الله -صلى الله عليه وسلم- قال: «لا تكتبوا عني، ومَن كتب عني غيرَ القرآن فَلْيَمْحُه، وحدِّثوا عنِّي ولا حَرَج، ومَن كذب عليَّ -قال همام: أحسِبه قال: مُتعمِّدًا- فَلْيَتَبوَّأ مَقْعَدَه مِن النار».',
        view:true},
        {Name:'قال أبو هريرة رضي الله عنه، عن رسول الله صلى الله عليه وسلم: (مَن كانَ يُؤْمِنُ باللَّهِ واليَومِ الآخِرِ، فلا يُؤْذِي جارَهُ، واسْتَوْصُوا بالنِّساءِ خَيْرًا، فإنَّهُنَّ خُلِقْنَ مِن ضِلَعٍ، وإنَّ أعْوَجَ شيءٍ في الضِّلَعِ أعْلاهُ، فإنْ ذَهَبْتَ تُقِيمُهُ كَسَرْتَهُ، وإنْ تَرَكْتَهُ لَمْ يَزَلْ أعْوَجَ، فاسْتَوْصُوا بالنِّساءِ خَيْرًا)',
        view:true},
        {Name:'رُوِي عن المقدام بن معد يكرب الكندي، عن رسول الله صلى الله عليه وسلّم أنّه قال: (إنَّ اللهَ يُوصِيكُم بالنساءِ خيرًا، إنَّ اللهَ يُوصِيكُم بالنساءِ خيرًا، فإنهنَّ أمهاتُكم وبناتُكم وخالاتُكم، إنَّ الرجلَ من أهلِ الكتابِ يتزوجُ المرأةَ وما تُعلَّقُ يداها الخيطَ، فما يرغبُ واحدٌ منهما عن صاحبِه حتّى يموتا هَرمًا).',
        view:true},
        {Name:'عن أبيّ بن كعب، أنّ رسول الله صلى الله عليه وسلّم قال: (ألا واستَوْصُوا بالنِّساءِ خَيرًا؛ فإنَّهُنَّ عَوَانٍ عندَكُم، ليس تَمْلِكون مِنهُنَّ شيئًا غيرَ ذلكَ، إلَّا أنْ يأتِينَ بفاحشةٍ مُبَيِّنةٍ، فإنْ فَعَلْنَ فاهجُروهُنَّ في المَضاجعِ، واضرِبوهُنَّ ضربًا غيرَ مُبَرِّحٍ، فإنْ أَطَعْنَكُم فلا تَبْغوا عليهِنَّ سبيلًا. ألَا إنَّ لكُم على نسائِكُم حقًّا، ولهُنَّ عليكُم حقًّا؛ فأمَّا حقُّكُم على نسائِكُم فلا يُوطِئْنَ فُرُشَكُم مَن تَكرَهون، ولا يَأْذَنَّ في بُيوتِكُم لمَن تَكرَهون، ألَا وإنَّ حقَّهُنَّ عليكُم أنْ تُحْسِنوا إليهِنَّ في كِسْوَتِهِنَّ وطَعامِهِنَّ).',
        view:true},
        {Name:'قال عليه الصلاة والسلام عن تطيب المرأة: (أيُّما امرأةٍ استعطَرَت فمرَّت علَى قومٍ ليجِدوا من ريحِها؛ فَهيَ زانيةٌ). ',
        view:true},
        {Name:'عن زينب الثقفية امرأة عبد الله بن مسعود عن الرسول عليه الصلاة والسلام: (إذا خرجتْ إحْداكنَّ إلى المسجدِ، فلا تقْرَبنَّ طِيبًا)، ',
        view:true},
        {Name:'رُوِي عن السيدة عائشة رضي الله عنها، قولها عن رسول الله عليه الصلاة والسلام بخصوص لباس المرأة المسلمة: (إنَّ أسماءَ بنتَ أبي بكرٍ أُخْتَها دَخَلَتْ على النبيِّ في لِباسٍ رقيقٍ يَشِفُّ عن جسمِها فأعرض النبيُّ عنها وقال: يا أسماءُ إن المرأةَ إذا بلغتِ المَحِيضَ لم يَصْلُحْ أن يُرَى منها إلا هذا وهذا وأشار إلى وجهِه وكَفَّيْهِ). ',
        view:true},
        {Name:'عن عبد الله بن عمرو عن رسول الله صلى الله عليه وسلم، أنّه قال: (سيكونُ في آخِرِ أمَّتي رجالٌ يركَبونَ على سُروجٍ كأشباهِ الرِّحالِ، ينزِلونَ على أبوابِ المساجدِ؛ نساؤُهم كاسياتٌ عارياتٌ على رؤوسِهنَّ كأسنمةِ البُخْتِ العِجافِ، الْعَنُوهُنَّ فإنَّهنَّ ملعوناتٌ، لو كان وراءَكم أمَّةٌ مِن الأممِ خدَمهنَّ نساؤُكم كما خدَمكم نساءُ الأممِ قبْلَكم). ',
        view:true},
        {Name:'روى مسلم عن عائشة أم المؤمنين رضي الله عنها في غيرة النساء: (أنَّ رَسولَ اللهِ صَلَّى اللَّهُ عليه وسلَّمَ خَرَجَ مِن عِندِهَا لَيْلًا، قالَتْ: فَغِرْتُ عليه، فَجَاءَ فَرَأَى ما أَصْنَعُ، فَقالَ: ما لَكِ؟ يا عَائِشَةُ أَغِرْتِ؟ فَقُلتُ: وَما لي لا يَغَارُ مِثْلِي علَى مِثْلِكَ؟ فَقالَ رَسولُ اللهِ صَلَّى اللَّهُ عليه وسلَّمَ: أَقَدْ جَاءَكِ شيطَانُكِ قالَتْ: يا رَسولَ اللهِ، أَوْ مَعِيَ شيطَانٌ؟ قالَ: نَعَمْ قُلتُ: وَمع كُلِّ إنْسَانٍ؟ قالَ: نَعَمْ قُلتُ: وَمعكَ؟ يا رَسولَ اللهِ، قالَ: نَعَمْ، وَلَكِنْ رَبِّي أَعَانَنِي عليه حتَّى أَسْلَمَ). ',
        view:true},
        {Name:'عن عائشة أم المؤمنين رضي الله عنها، قالت: (ما غِرْتُ علَى أحَدٍ مِن نِسَاءِ النبيِّ صَلَّى اللهُ عليه وسلَّمَ، ما غِرْتُ علَى خَدِيجَةَ، وما رَأَيْتُهَا، ولَكِنْ كانَ النبيُّ صَلَّى اللهُ عليه وسلَّمَ يُكْثِرُ ذِكْرَهَا، ورُبَّما ذَبَحَ الشَّاةَ ثُمَّ يُقَطِّعُهَا أعْضَاءً، ثُمَّ يَبْعَثُهَا في صَدَائِقِ خَدِيجَةَ، فَرُبَّما قُلتُ له: كَأنَّهُ لَمْ يَكُنْ في الدُّنْيَا امْرَأَةٌ إلَّا خَدِيجَةُ، فيَقولُ إنَّهَا كَانَتْ، وكَانَتْ، وكانَ لي منها ولَدٌ). ',
        view:true},
        {Name:'ندما سُئِل رسول الله صلى الله عليه وسلم عن حقّ الزوجةِ على الزوج، قال: (أن تُطعمها إذا طَعِمتْ، وتكسُوها إذا اكْتَسيتَ، ولا تُقبّحْ، ولا تَهْجُرْ إلا في البيتِ). ',
        view:true},
        {Name:'عن سعد بن أبي وقاص، قال: (عَادَنِي رَسولُ اللَّهِ صَلَّى اللهُ عليه وسلَّمَ في حَجَّةِ الوَدَاعِ، مِن شَكْوَى أشْفَيْتُ منه علَى المَوْتِ، فَقُلتُ: يا رَسولَ اللَّهِ، بَلَغَ بي ما تَرَى مِنَ الوَجَعِ، وأَنَا ذُو مَالٍ، ولَا يَرِثُنِي إلَّا ابْنَةٌ لي واحِدَةٌ، أفَأَتَصَدَّقُ بثُلُثَيْ مَالِي؟ قالَ: لا قُلتُ: فَبِشَطْرِهِ؟ قالَ: الثُّلُثُ كَثِيرٌ، إنَّكَ أنْ تَذَرَ ورَثَتَكَ أغْنِيَاءَ خَيْرٌ مِن أنْ تَذَرَهُمْ عَالَةً يَتَكَفَّفُونَ النَّاسَ، وإنَّكَ لَنْ تُنْفِقَ نَفَقَةً تَبْتَغِي بهَا وجْهَ اللَّهِ إلَّا أُجِرْتَ، حتَّى ما تَجْعَلُ في فِي امْرَأَتِكَ). ',
        view:true},
        {Name:'عن عبد الله بن عمر أنَّهُ سَمِعَ رَسولَ اللَّهِ صَلَّى اللهُ عليه وسلَّمَ، يقولُ: (كُلُّكُمْ رَاعٍ ومَسْؤولٌ عن رَعِيَّتِهِ، فَالإِمَامُ رَاعٍ وهو مَسْئُولٌ عن رَعِيَّتِهِ، والرَّجُلُ في أهْلِهِ رَاعٍ وهو مَسْئُولٌ عن رَعِيَّتِهِ، والمَرْأَةُ في بَيْتِ زَوْجِهَا رَاعِيَةٌ وهي مَسْئُولَةٌ عن رَعِيَّتِهَا، والخَادِمُ في مَالِ سَيِّدِهِ رَاعٍ وهو مَسْئُولٌ عن رَعِيَّتِهِ). ',
        view:true},
        {Name:'(خيرُ النِّساءِ امرأةٌ إذا نظرتَ إليها سرَّتكَ، وإذا أمرتَها أطاعتْكَ، وإذا غِبتَ عنها حفِظتْكَ في نفسِها ومالِكَ، ثمَّ قرأَ رسولُ اللَّهِ صلَّى اللَّهُ عليهِ وسلَّمَ هذِهِ الآيةَ الرِّجالُ قوَّامونَ علَى النِّساءِ إلى آخرِها). ',
        view:true},
        {Name:'قال الرسول الكريم صلى الله عليه وسلم: (فإني لو أَمرتُ شيئًا أن يسجدَ لشيءٍ ؛ لأمَرتُ المرأةَ أن تسجُدَ لزوجِها، والذي نفسي بيدِه، لا تُؤدِّي المرأةُ حقَّ ربِّها حتى تُؤَدِّيَ حقَّ زوجِها). ',
        view:true},
        {Name:'قال رسول الله صلى الله عليه وسلم: (إذا دعا الرجلُ امرأتَهُ إلى فراشِهِ فأَبَتْ، فبات غضبانَ عليها، لعنتها الملائكةُ حتى تُصبحَ). ',
        view:true},
        {Name:'عن أبي هريرة رضي الله عنه عن رسول الله صلى الله عليه وسلم: (لَا يَفْرَكْ مُؤْمِنٌ مُؤْمِنَةً، إنْ كَرِهَ منها خُلُقًا رَضِيَ منها آخَرَ، أَوْ قالَ: غَيْرَهُ). ',
        view:true},
        {Name:'(إنّ المرأةَ خُلِقتْ من ضلعٍ، وإنَّك إن تُرِدْ إقامةَ الضلعِ تكسرُها، فدارِها تعِشْ بها). ',
        view:true},
        {Name:'قال رسول الله: (لو تعلمُ المرأةُ حقَّ الزوْجِ، لم تَقْعُدْ ما حضَرَ غدَاؤُهُ وعَشَاؤُهُ؛ حتى يفرَغَ منه). ',
        view:true},
        {Name:'(أكملُ المؤمنين إيمانًا أحسنُهم خُلقًا، وخيارُكم خيارُكم لنسائهم). ',
        view:true},
        {Name:'ممّا قاله رسول الله صلى الله عليه وسلم عن العدل بين الزوجات: (منْ كان لهُ امرأتانِ يَمِيلُ لإحداهُما على الأُخرَى، جاء يومَ القيامةِ أحَدُ شِقَّيْهِ مائلٌ شَكَّ يَزِيدُ). ',
        view:true},
        {Name:'قد تكون المرأة أعظم فتنةٍ، وفي ذلك قال رسولنا الكريم: (إنَّ الدُّنْيَا حُلْوَةٌ خَضِرَةٌ، وإنَّ اللهَ مُسْتَخْلِفُكُمْ فِيهَا، فَيَنْظُرُ كيفَ تَعْمَلُونَ، فَاتَّقُوا الدُّنْيَا وَاتَّقُوا النِّسَاءَ، فإنَّ أَوَّلَ فِتْنَةِ بَنِي إِسْرَائِيلَ كَانَتْ في النِّسَاءِ). ',
        view:true},
        {Name:'روى مسلم عن أبي هريرة رضي الله عنه: (جَاءَ رَجُلٌ إلى رَسُولِ اللهِ صَلَّى اللَّهُ عليه وَسَلَّمَ، فَقالَ: مَن أَحَقُّ النَّاسِ بحُسْنِ صَحَابَتِي؟ قالَ: أُمُّكَ قالَ: ثُمَّ مَنْ؟ قالَ: ثُمَّ أُمُّكَ قالَ: ثُمَّ مَنْ؟ قالَ: ثُمَّ أُمُّكَ قالَ: ثُمَّ مَنْ؟ قالَ: ثُمَّ أَبُوكَ. وفي حَديثِ قُتَيْبَةَ: مَن أَحَقُّ بحُسْنِ صَحَابَتي وَلَمْ يَذْكُرِ النَّاسَ). ',
        view:true},
        {Name:'قال رسول الله صلى الله عليه وسلم: (لن يجزيَ ولدٌ والدَه إلا أن يجدَه مملوكًا فيشتريَه فيعتقَه). ',
        view:true},
        {Name:'ال رسول الله صلى الله عليه وسلم: (رَغِمَ أنْفُهُ، ثُمَّ رَغِمَ أنْفُهُ، ثُمَّ رَغِمَ أنْفُهُ قيلَ: مَنْ؟ يا رَسولَ اللهِ، قالَ: مَن أدْرَكَ والِدَيْهِ عِنْدَ الكِبَرِ، أحَدَهُما، أوْ كِلَيْهِما، ثُمَّ لَمْ يَدْخُلِ الجَنَّةَ). ',
        view:true},
        {Name:'قال رسول الله -صلى الله عليه وسلم-: (إنَّكم سَتفتَحونَ أرضًا يُذكَرُ فيها القِيراطُ، فاستَوصوا بأَهلِها خيرًا؛ فإنَّ لهم ذِمَّةً ورَحِمًا، فإنْ رَأيتُم رَجُلين يَقتَتلانِ في مَوضعِ لَبِنةٍ فاخرُجْ مِنها). ',
        view:true},
        {Name:'قال النبيُّ -صَلَّى اللهُ عليه وسلَّمَ-: (اللَّهُمَّ بَارِكْ لَنَا في شَأْمِنَا، اللَّهُمَّ بَارِكْ لَنَا في يَمَنِنَا قالوا: يا رَسولَ اللَّهِ، وفي نَجْدِنَا؟ قالَ: اللَّهُمَّ بَارِكْ لَنَا في شَأْمِنَا، اللَّهُمَّ بَارِكْ لَنَا في يَمَنِنَا قالوا: يا رَسولَ اللَّهِ، وفي نَجْدِنَا؟ فأظُنُّهُ قالَ في الثَّالِثَةِ: هُنَاكَ الزَّلَازِلُ والفِتَنُ، وبِهَا يَطْلُعُ قَرْنُ الشَّيْطَانِ). ',
        view:true},
        {Name:'قال رسول الله -صلى الله عليه وسلم-: (بَيْنا أنا في مَنامي، أتَتْني الملائكةُ، فحمَلَتْ عَمودَ الكتابِ من تحتِ وِسادَتي، فعمَدَتْ به إلى الشامِ، ألَا فالإيمانُ حيث تقَعُ الفِتَنُ بالشام).',
        view:true},
        {Name:'قال رسول الله -صلى الله عليه وسلم-: (يتقارَبُ الزَّمانُ وينقُصُ العِلمُ وتظهَرُ الفِتنُ ويُلقى الشُّحُّ ويكثُرُ الهَرْجُ) قالوا : وما الهَرْجُ يا رسولَ اللهِ ؟ قال : (القتلُ القتلُ)). ',
        view:true},
        {Name:'قال رسول الله -صلى الله عليه وسلم-: (إنَّ بيْنَ يَدَيِ السَّاعَةِ لَأَيّامًا، يَنْزِلُ فيها الجَهْلُ، ويُرْفَعُ فيها العِلْمُ، ويَكْثُرُ فيها الهَرْجُ والهَرْجُ: القَتْلُ). ',
        view:true},
        {Name:'قال رسول الله -صلى الله عليه وسلم-: (لا تَقُومُ السَّاعَةُ حتَّى يَمُرَّ الرَّجُلُ بقَبْرِ الرَّجُلِ فيَقولُ: يا لَيْتَنِي مَكانَهُ). ',
        view:true},
        {Name:'قال رسول الله -صلى الله عليه وسلم-: (لا تقومُ الساعةُ حتى يخرجَ رجلٌ من قحطانَ يسوقُ الناسَ بعصاهُ). ',
        view:true},
        {Name:'قال رسول الله -صلى الله عليه وسلم-: (أول أشراط الساعة نار تحشر الناس من المشرق إلى المغرب). ',
        view:true},
        {Name:'قال رسول الله -صلى الله عليه وسلم-: (إنَّكُمْ سَتَرَوْنَ بَعْدِي أثَرَةً وأُمُورًا تُنْكِرُونَها قالوا: فَما تَأْمُرُنا يا رَسولَ اللَّهِ؟ قالَ: أدُّوا إليهِم حَقَّهُمْ، وسَلُوا اللَّهَ حَقَّكُمْ). ',
        view:true},
        {Name:'قال رسول الله -صلى الله عليه وسلم-: (يُوشِكُ الفُرَاتُ أن يُحسَرَ عن كَنْزٍ مِن ذَهَبٍ، فمَن حضَره فلا يأخُذْ منه شيئًا). ',
        view:true},
        {Name:'قال رسول الله -صلى الله عليه وسلم-: (تَصَدَّقُوا فَسَيَأْتي علَى النَّاسِ زَمانٌ يَمْشِي الرَّجُلُ بصَدَقَتِهِ، فلا يَجِدُ مَن يَقْبَلُها). ',
        view:true},
        {Name:'قال رسول الله -صلى الله عليه وسلم-: (لا تَقُومُ السَّاعَةُ حتَّى تَقْتَتِلَ فِئَتانِ عَظِيمَتانِ، يَكونُ بيْنَهُما مَقْتَلَةٌ عَظِيمَةٌ، دَعْوَتُهُما واحِدَةٌ، وحتَّى يُبْعَثَ دَجَّالُونَ كَذَّابُونَ، قَرِيبٌ مِن ثَلاثِينَ، كُلُّهُمْ يَزْعُمُ أنَّه رَسولُ اللَّهِ، وحتَّى يُقْبَضَ العِلْمُ، وتَكْثُرَ الزَّلازِلُ، ويَتَقارَبَ الزَّمانُ، وتَظْهَرَ الفِتَنُ، ويَكْثُرَ الهَرْجُ، وهو القَتْلُ، وحتَّى يَكْثُرَ فِيكُمُ المالُ فَيَفِيضَ، حتَّى يُهِمَّ رَبَّ المالِ مَن يَقْبَلُ صَدَقَتَهُ، وحتَّى يَعْرِضَهُ عليه، فَيَقُولَ الذي يَعْرِضُهُ عليه: لا أرَبَ لي به، وحتَّى يَتَطاوَلَ النَّاسُ في البُنْيانِ، وحتَّى يَمُرَّ الرَّجُلُ بقَبْرِ الرَّجُلِ فيَقولُ: يا لَيْتَنِي مَكانَهُ وحتَّى تَطْلُعَ الشَّمْسُ مِن مَغْرِبِها، فإذا طَلَعَتْ ورَآها النَّاسُ -يَعْنِي آمَنُوا- أجْمَعُونَ، فَذلكَ حِينَ لا يَنْفَعُ نَفْسًا إيمانُها لَمْ تَكُنْ آمَنَتْ مِن قَبْلُ، أوْ كَسَبَتْ في إيمانِها خَيْرًا، ولَتَقُومَنَّ السَّاعَةُ وقدْ نَشَرَ الرَّجُلانِ ثَوْبَهُما بيْنَهُما، فلا يَتَبايَعانِهِ ولا يَطْوِيانِهِ، ولَتَقُومَنَّ السَّاعَةُ وقَدِ انْصَرَفَ الرَّجُلُ بلَبَنِ لِقْحَتِهِ فلا يَطْعَمُهُ، ولَتَقُومَنَّ السَّاعَةُ وهو يُلِيطُ حَوْضَهُ فلا يَسْقِي فِيهِ، ولَتَقُومَنَّ السَّاعَةُ وقدْ رَفَعَ أُكْلَتَهُ إلى فِيهِ فلا يَطْعَمُها). ',
        view:true},
        {Name:'قال رسول الله صلى الله عليه وسلم: (لَيأتِينَّ على الناسِ زَمانٌ قلوبُهم قلوبُ الأعاجمِ، حُبُّ الدُّنيا، سُنَّتُهم سُنَّةُ الأعرابِ، ما أتاهم من رزقٍ جعلوه في الحيوانِ، يَرَوْن الجهادَ ضَررًا، والزكاةَ مَغْرمًا). ',
        view:true},
        {Name:'قال رسول الله صلى الله عليه وسلم: (يأتي على الناسِ زمانٌ ما يُبَالِي الرجلُ من أين أصاب المالَ؟ مِن حلالٍ أو حرامٍ). ',
        view:true},
        {Name:'قال رسول الله صلى الله عليه وسلم: (أنَّ بينَ يدِيِ الساعَةِ تسليمُ الخاصَّةِ، وفَشْوُ التجارَةِ، حينَ تُعِينُ المرأةُ، زوجَها على التجارةِ، وقطعُ الأرحامِ، وشهادةُ الزورِ، وكتمانُ شهادةِ الحقِّ، وظهورُ العلْمِ، وفي روايَةٍ قال رسولُ اللهِ صلَّى اللهُ عليه وسلَّم: إِنَّ مِنْ أشراطِ الساعَةِ أنْ يُسَلِّمَ الرجُلُ لَا يُسَلِّمُ إلَّا للمعرفَةِ). ',
        view:true},
        {Name:'قال رسول الله صلى الله عليه وسلم: (يَكونُ في هذه الأُمَّةِ في آخِرِ الزَّمانِ رِجالٌ -أو قال: يَخرُجُ رِجالٌ مِن هذه الأُمَّةِ في آخِرِ الزَّمانِ- معهم أسْياطٌ كأنَّها أذنابُ البَقرِ، يَغدونَ في سَخَطِ اللهِ، ويَروحونَ في غَضَبِه). ',
        view:true},
        {Name:'شكا رجال إلى أنس بن مالك -رضي الله عنه- من سوء ما يلقونه من الحَجّاج، فقال لهم: (اصْبِرُوا، فإنَّه لا يَأْتي علَيْكُم زَمَانٌ إلَّا الذي بَعْدَهُ شَرٌّ منه، حتَّى تَلْقَوْا رَبَّكُمْ سَمِعْتُهُ مِن نَبِيِّكُمْ صَلَّى اللهُ عليه وسلَّمَ). ',
        view:true},
        {Name:'قال رسول الله صلى الله عليه وسلم: (سيَأتي علَى النَّاسِ سنواتٌ خدَّاعاتُ يصدَّقُ فيها الكاذِبُ ويُكَذَّبُ فيها الصَّادِقُ ويُؤتَمنُ فيها الخائنُ ويُخوَّنُ فيها الأمينُ وينطِقُ فيها الرُّوَيْبضةُ قيلَ وما الرُّوَيْبضةُ قالَ الرَّجلُ التَّافِهُ في أمرِ العامَّةِ). ',
        view:true},
        {Name:'قال رسول الله صلى الله عليه وسلم: (يَتَقارَبُ الزَّمانُ، ويُقْبَضُ العِلْمُ، وتَظْهَرُ الفِتَنُ، ويُلْقَى الشُّحُّ، ويَكْثُرُ الهَرْجُ قالوا: وما الهَرْجُ؟ قالَ: القَتْلُ). ',
        view:true},
        {Name:'قال رسول الله صلى الله عليه وسلم: (سيكونُ في آخرِ الزمانِ خَسْفُ وقذفٌ ومَسْخٌ، إذا ظَهَرَتِ المعازِفُ والقَيْناتُ، واسْتُحِلَّتِ الخمْرُ). ',
        view:true},
        {Name:'قال رسول الله صلى الله عليه وسلم: (يَكونُ في آخِرِ الزَّمانِ خَلِيفَةٌ يَقْسِمُ المالَ ولا يَعُدُّهُ). ',
        view:true},
        {Name:'قال رسول الله صلى الله عليه وسلم: (ثُمَّ يُقَالُ لِلأَرْضِ: أَنْبِتي ثَمَرَتَكِ، وَرُدِّي بَرَكَتَكِ، فَيَومَئذٍ تَأْكُلُ العِصَابَةُ مِنَ الرُّمَّانَةِ، وَيَسْتَظِلُّونَ بقِحْفِهَا، وَيُبَارَكُ في الرِّسْلِ، حتَّى أنَّ اللِّقْحَةَ مِنَ الإبِلِ لَتَكْفِي الفِئَامَ مِنَ النَّاسِ، وَاللِّقْحَةَ مِنَ البَقَرِ لَتَكْفِي القَبِيلَةَ مِنَ النَّاسِ وَاللِّقْحَةَ مِنَ الغَنَمِ لَتَكْفِي الفَخِذَ مِنَ النَّاسِ). ',
        view:true},
        {Name:'قال رسول الله صلى الله عليه وسلم: (إنَّكم في زمانٍ من ترَك منكم عشرَ ما أمرَ بِه هلَك ثمَّ يأتي زمانٌ من عملَ منكم بعشرِ ما أمرَ بِه نجا). ',
        view:true},
        {Name:'قال رسول الله صلى الله عليه وسلم: (لا تَزالُ طائفةٌ مِن أُمَّتي على الحَقِّ ظاهرينَ، لا يَضُرُّهم مَن خالَفَهم حتى يَأتيَ أمْرُ اللهِ). ',
        view:true},
        {Name:'قال رسول الله صلى الله عليه وسلم: (فيَهْزِمُ اللهُ اليهودَ، فلا يَبْقَى شيءٌ مِمَّا خلق اللهُ عَزَّ وجَلَّ يَتَواقَى به يهوديٌّ، إلا أَنْطَقَ اللهُ ذلك الشيءَ، لا حَجَرٌ ولا شجرٌ ولا حائطٌ ولا دابةٌ، إلا الغَرْقَدَةُ، فإنها من شَجَرِهِم لا تَنْطِقُ، إلا قال: يا عبدَ اللهِ المسلمَ هذا يهوديٌّ فتَعَالَ اقتُلْه، فيكونُ عيسى ابنُ مريمَ في أُمَّتِي حَكَمًا عَدْلًا، وإمامًا مُقْسِطًا يَدُقُّ الصليبَ، ويَذْبَحُ الخِنْزيرَ، ويضعُ الجِزْيةَ، ويتركُ الصدقةَ، فلا يَسْعَى على شاةٍ ولا بعيرٍ، وتُرْفَعُ الشحناءُ والتباغُضُ، وتُنْزَعُ حِمَةُ كلِّ ذاتِ حِمَةٍ). ',
        view:true},

        ],

      }
    }
  }

  makesearch(searchText) {
    let list = this.state.Arr2
    for (let i = 0; i < list.length; i++) {
      if (((list[i].Name).toUpperCase()).includes(searchText.toUpperCase())) {
        list[i].view = true
      }
      else {
        list[i].view = false
      }
    }
    this.setState({ Arr2: list })
  }

  render() {
    return (
      <>
        <StatusBar backgroundColor="#0c0c0c" />


        <ImageBackground source={require('../img/21.jpg')}
          style={{
            height: height,
            width: width,
            justifyContent: "flex-start",
            alignItems: "flex-start",
          }}
          resizeMode={'cover'}>



          <View style={{
            flex: 1,
          }}>






            <ScrollView>



              <Animatable.View
                animation={"fadeInRightBig"}>

                <View
                  style={{
                    justifyContent: "center",
                    alignItems: "center",
                    alignSelf: "center",
                    padding: 10,
                    paddingHorizontal: 50,
                    borderRadius: 20,
                    backgroundColor: "#bbbbbb",
                    marginTop: 5
                  }}>

                  <Text style={{
                    fontSize: 20,
                    color: COLORS.background
                  }}>الاحاديث النبويه</Text>

                </View>

                <View style={{
                  // backgroundColor: '#008bff',
                  flexDirection: "row",
                  alignItems: "center",
                  alignSelf: "center",
                  justifyContent: "center"
                }}>
                  <View style={{
                    width: "100%",
                    flexDirection: "row",
                    justifyContent: 'space-evenly',
                    alignItems: "center",
                    // borderBottomRadius: 1,
                    borderRadius: 50,
                    borderColor: COLORS.white,
                    borderBottomWidth: 3,
                    //   backgroundColor:"#f0f"

                  }}>
                    <TouchableOpacity>
                      <FontAwesome5 name='search' size={20} color={COLORS.gray} style={{ padding: 10 }} />
                    </TouchableOpacity>
                    <TextInput style={{
                      color: '#fff',
                      padding: 10,
                      fontSize: 20,
                      width: "80%"
                    }}
                      placeholder={'بحث'}
                      placeholderTextColor={COLORS.gray}
                      onChangeText={(value) => {
                        this.makesearch(value)
                        this.setState({ search: value })
                      }}
                      value={this.state.search}>

                    </TextInput>
                  </View>


                </View>


                {this.state.Arr2.map((items, index) =>
                  items.view ? (
                    <View style={{
                      padding: 20,
                      backgroundColor: COLORS.Yellow,
                      borderRadius: 10,
                      marginTop: 5,
                      marginHorizontal: 10,
                      flexDirection: "row",
                      justifyContent: 'center',
                    }}>
                      <Text style={{
                        fontSize: 15,
                        color: "#fff",

                      }}> . {index + 1}</Text>

                      <Text style={{
                        fontSize: 15,
                        color:COLORS.white,
                      }}>{items.Name}</Text>

                    </View>
                  ) : (null)
                )}




              </Animatable.View>
              <View style={{ height: 60, width: width }}></View>

            </ScrollView>
          </View>
        </ImageBackground>





      </>
    )
  }
}
